open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
/****************************************************************************
 * arch/arm/src/bk7258/bk7258_wifi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

/****************************************************************************
 * BK7258 AP-side Wi-Fi controller-interface driver.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_WIFI

#include <assert.h>
#include <errno.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/kthread.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/net/netdev_lowerhalf.h>
#include <nuttx/semaphore.h>
#include <nuttx/spinlock.h>
#include <nuttx/wireless/wireless.h>

#include <net/if_arp.h>

#include "bk7258_driver.h"
#include "hardware/bk7258_mbox.h"
#include "hardware/bk7258_wifi_ipc.h"
#include "hardware/bk7258_wifi_probe.h"
#include "bk7258_netstats.h"
#include "bk7258_wifi.h"
#include "include/bk7258_wifi_profile.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define WIFI_NODE_QUEUE          16u
#define WIFI_RECYCLE_QUEUE       16u
/* How many delivered frames can be held for the upper half at once.
 *
 * This is the capacity of a single mailbox transaction rather than a running
 * buffer, and that is the problem with it.  wifi_handle_data() queues a
 * frame
 * only while there is room -- "packet_count + packet_added <
 * WIFI_PACKET_QUEUE" -- and it holds packet_lock and the driver spinlock for
 * the whole loop, so the upper half cannot free a single slot while the loop
 * runs.  Frames past the limit are dropped in silence: the CP has already
 * been told the list was taken, nothing retries them, and rx_queue_full is
 * the only record that it happened.
 *
 * Four against a BK7258_WIFI_MAX_LIST of sixty is a real mismatch, and it
 * does cost frames: a measured 15-second download lost 32 of them here,
 * roughly four percent, while the sender sat at a congestion window of one.
 *
 * It stays at four all the same, for two measured reasons.  Sixty costs 91
 * KB
 * because every entry carries a whole frame, and even ten costs 9 KB, which
 * took this build to 97.5% of RAM and left the AP core failing to start --
 * the early SRAM heap is what runs out, before PSRAM is folded in and before
 * anything can print.  And the size of the prize does not justify it: the
 * same run showed 264 retransmissions against those 32 dropped frames, so
 * most of the loss is happening somewhere this queue cannot explain.
 *
 * Pacing a sender so that no transaction carried more than three frames
 * moved
 * 63.6 KB/s over the same link with nothing dropped and nothing
 * retransmitted, which is what identified the queue rather than the radio.
 *
 * Sixty is affordable only because a slot now holds a netpkt pointer rather
 * than a 1514-byte copy: 60 slots cost 480 bytes where 4 slots of frame cost
 * 6080.  Copying whole frames is what forced the queue to be small, and an
 * attempt to keep the copies while growing the queue to ten took RAM to
 * 97.5%
 * and left the AP core failing to boot.
 *
 * Slots are deliberately cheaper than the thing that really limits how many
 * frames can be outstanding, which is the read-ahead pool.  With sixty of
 * them
 * a full chain always has somewhere to go, so rx_queue_full stays at zero
 * and
 * a shortage shows up as rx_alloc_fail instead -- an unambiguous distinction
 * between "no slot" and "no buffer" that a single number could not give.
 */

#define WIFI_PACKET_QUEUE        BK7258_WIFI_MAX_LIST

/* How many receive netpkts may be outstanding, published to the upper half
 * as
 * this device's RX quota.
 *
 * It cannot just be WIFI_PACKET_QUEUE.  netdev_lower_register() refuses a
 * device whose quotas outrun the buffer pool: quota_is_valid() requires
 * quota[TX] + quota[RX] <= NETPKT_BUFNUM, and NETPKT_BUFNUM is
 * CONFIG_IOB_NBUFFERS.  Eight TX slots against sixty RX came to 68 against a
 * pool of 40, registration returned -EINVAL, and the board came up with no
 * wlan0 at all -- "Wi-Fi initialization failed, error=-22".
 *
 * The value is chosen against the second thing quota_is_valid() looks at:
 * beyond NETPKT_BUFNUM / 2 it warns that one device may take more than half
 * the buffers.  With eight TX slots and a pool of 60, twenty keeps the pair
 * at
 * 28 against a half of 30.  That warning is worth respecting because its
 * reason is the one that matters here -- TCP's advertised window comes out
 * of
 * the same pool, since tcp_get_recvwindow() offers iob_navail(true) *
 * CONFIG_IOB_BUFSIZE, so every buffer parked in this driver is one the
 * window
 * has already surrendered.
 *
 * Twenty is five times the four frames that used to fit and comfortably over
 * the longest chain measured on this link, which was ten.
 *
 * The result is the backpressure the vendor's firmware assembles by hand.
 * There the AP grants the CP a credit of buffers and the CP cannot deliver
 * past it (wdrv_attach_rx_buffer(), wdrv_main.c, rx_win starting at
 * INIT_NUM_RX_BUFFERS).  Here the pool shrinks the window first, so a sender
 * eases off before anything has to be dropped.
 */

#define WIFI_RX_QUOTA            20

#define WIFI_COMMAND_TIMEOUT     MSEC2TICK(2000)
#define WIFI_ROLE_STOP_TIMEOUT   MSEC2TICK(3000)
#define WIFI_WORK_INTERVAL       MSEC2TICK(20)
#define WIFI_PBUF_TYPE_RAM       0x80u
#define WIFI_EVENT_DATA_OFFSET   12u
#define WIFI_STA_STATUS_CONNECTED 3u
#if defined(CONFIG_WIRELESS_WAPI_SCAN_MAX_DATA) && \
    CONFIG_WIRELESS_WAPI_SCAN_MAX_DATA < 4096
#  define WIFI_SCAN_CACHE_LIMIT CONFIG_WIRELESS_WAPI_SCAN_MAX_DATA
#else
#  define WIFI_SCAN_CACHE_LIMIT 4096
#endif

struct wifi_command_slot
{
  uint8_t bytes[BK7258_WIFI_CMD_SLOT_SIZE] __attribute__((aligned(32)));
  bool owned;
  bool transport_pending;
  uint16_t command;
  uint16_t sequence;
  uint32_t generation;
};

/* End of a slot chain.  Slot indices are small (CONFIG_BK7258_WIFI_TX_SLOTS
 * is
 * eight by default) and zero is a valid one, so the terminator cannot be
 * zero
 * and the chain heads cannot rely on g_wifi being zero-initialised.
 */

#define WIFI_TX_CHAIN_END 0xFFu

