open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
struct aligned_data(32) wifi_tx_slot
{
  struct bk7258_wifi_pbuf pbuf;
  uint8_t headroom[BK7258_WIFI_TX_HEADROOM];
  uint8_t frame[BK7258_WIFI_MAX_FRAME];
  netpkt_t *packet;
  bool active;
  bool transport_pending;
  bool transport_rejected;
  uint8_t vif;
  uint32_t role_epoch;

  /* Next slot in whichever of the two chains below holds this one.  Frames
   * are
   * handed to the CP as a chain rather than one at a time (see
   * wifi_flush_tx),
   * so a slot belongs to at most one chain and the chain is walked by index
   * here rather than through the cpdu's own next pointer -- that one lives
   * in
   * memory the CP writes, and the completion path must not depend on it.
   */

  uint8_t chain_next;
};

/* A received frame on its way to the stack.
 *
 * The netpkt is allocated and filled in wifi_handle_data(), so this holds a
 * pointer rather than a copy of the frame and wifi_receive() has nothing
 * left
 * to do but hand it over.  That removes the second copy the frame used to
 * make and, more to the point, lets the queue be as deep as the CP is
 * allowed
 * to be generous.
 *
 * role_epoch travels with the packet because the role can change while it
 * waits: a frame belonging to a role that has since gone away must be freed
 * rather than delivered.
 */

struct wifi_rx_packet
{
  netpkt_t *packet;
  uint32_t role_epoch;
};

enum wifi_role
{
  WIFI_ROLE_NONE = 0,
  WIFI_ROLE_STA,
  WIFI_ROLE_SOFTAP
};

enum wifi_role_state
{
  WIFI_ROLE_IDLE = 0,
  WIFI_ROLE_STARTING,
  WIFI_ROLE_ACTIVE,
  WIFI_ROLE_STOPPING
};

struct wifi_role_config
{
  char ssid[33];
  char password[64];
  int32_t wpa_version;
  int32_t cipher;
  uint8_t channel;
};

struct wifi_pending_node
{
  struct bk7258_wifi_ipc_node node;
  uint32_t generation;
  uint32_t role_epoch;
  uint8_t recycle_index;
  bool recycle_reserved;
};

enum wifi_recycle_state
{
  WIFI_RECYCLE_FREE = 0,
  WIFI_RECYCLE_RESERVED,
  WIFI_RECYCLE_QUEUED,
  WIFI_RECYCLE_SENDING,
  WIFI_RECYCLE_DISCARD
};

struct wifi_recycle_entry
{
  struct bk7258_wifi_ipc_node node;
  uint32_t generation;
  enum wifi_recycle_state state;
};

struct wifi_net_notifications
{
  netpkt_t *tx_packets[CONFIG_BK7258_WIFI_TX_SLOTS];
  uint8_t tx_count;
  bool rxready;
};

struct wifi_driver
{
  struct netdev_lowerhalf_s lower;
  mutex_t command_lock;
  mutex_t event_lock;
  mutex_t packet_lock;
  mutex_t scan_lock;
  sem_t command_sem;
  sem_t role_sem;
  sem_t work_sem;
  sem_t ready_sem;
  struct wifi_pending_node nodes[WIFI_NODE_QUEUE];
  struct wifi_recycle_entry recycle[WIFI_RECYCLE_QUEUE];
  struct wifi_rx_packet packets[WIFI_PACKET_QUEUE];
  struct wifi_command_slot command[BK7258_WIFI_CMD_SLOTS];
  struct wifi_tx_slot tx[CONFIG_BK7258_WIFI_TX_SLOTS];

  /* Outgoing frames waiting for the mailbox, and the batch currently handed
   * over and waiting for its acknowledgement.
   *
   * The mailbox carries one transaction at a time across all of its
   * channels,
   * and a transaction can describe a whole chain of frames -- the CP walks
   * it
   * (cif_main.c: for (i = 0; i < msg.num && head != NULL; i++)).  Sending
   * one
   * frame per transaction therefore spends a turn on the shared link for
   * every
   * forty-byte acknowledgement a download produces, which is most of what
   * the
   * outbound direction carries.  Accumulating instead is what the vendor's
   * own
   * AP firmware does (wdrv_txdata_pre_process(), wdrv_tx.c), and tx_sent_num
   * here is its sending_flag.
   */

  uint8_t tx_pend_head;
  uint8_t tx_pend_tail;
  uint8_t tx_pend_num;
  uint8_t tx_sent_head;
  uint8_t tx_sent_num;

  /* How well the batching actually works, which is not something the shape
   * of
   * the code can tell you: it depends on whether frames arrive while a
   * transaction is already in flight.  Mirrors the vendor's tx_list_num and
   * ipc_txc_cnt, and is read through bk7258_net_get_counters() so that a
   * measurement does not have to go out over the console -- console traffic
   * shares the mailbox and would perturb the thing being measured.
   */

  uint32_t tx_batches;
  uint32_t tx_batched_frames;
  uint8_t tx_batch_max;

  /* The same question in the receive direction, which is the one a download
   * depends on.  The CP chains arriving frames and one transaction can carry
   * up to BK7258_WIFI_MAX_LIST of them, so rx_listed_frames / rx_lists says
   * whether the mailbox is delivering full batches or one frame at a time.
   * A slow transfer whose ratio sits near 1 was not waiting on the mailbox.
   *
   * Only frames the peer sent are counted in rx_listed_frames.  A channel 2
   * list also carries our own transmitted buffers coming back, which is what
   * tx_completions counts; lumping the two together overstates the receive
   * side by roughly one frame per segment acknowledged.
   *
   * rx_queue_full is a frame the CP delivered that would not fit in the
   * queue the upper half drains.  Nothing else reports it.
   */

  uint32_t rx_lists;
  uint32_t rx_listed_frames;
  uint32_t tx_completions;
  uint32_t rx_queue_full;
  uint32_t rx_alloc_fail;
  uint8_t rx_list_max;

  /* Frames the stack handed down that never reached the air.  Every one of
   * these paths is otherwise silent: the refusals return an errno the upper
   * half discards, and the rejected ones are freed by
   * wifi_collect_rejected_tx() without a word.  Only slot exhaustion prints,
   * and it has never been seen.
   */

  uint32_t tx_enetdown;
  uint32_t tx_slots_full;
  uint32_t tx_rejected;

  uint8_t node_head;
  uint8_t node_tail;
  uint8_t node_count;
  uint8_t recycle_head;
  uint8_t recycle_tail;
  uint8_t recycle_count;
  uint8_t packet_head;
  uint8_t packet_tail;
  uint8_t packet_count;
  uint16_t next_sequence;
  uint16_t waiting_id;
  uint16_t waiting_sequence;
  int command_result;
  uint16_t command_length;
  uint8_t command_data[256];
  uint8_t *scan_cache;
  uint16_t scan_cache_length;
  struct wifi_role_config sta_config;
  struct wifi_role_config ap_config;
  enum wifi_role_state role_state;
  bool admin_up;
  enum wifi_role configured_role;
  enum wifi_role active_role;
  bool ap_started;
  uint8_t ap_client_count;
  uint8_t sta_mac[6];
  uint8_t ap_mac[6];
  uint32_t role_epoch;
  bool tx_gate;
  bool initialized;
  bool carrier;
  bool carrier_notified;
  bool scan_running;
  bool scan_cached;
  uint32_t reset_generation;
};

static struct wifi_driver g_wifi;
static volatile int g_worker_result;
static unsigned int g_wifi_rx_trace;
static unsigned int g_wifi_tx_trace;
static bk7258_wifi_event_cb_t g_wifi_event_callback;
static void *g_wifi_event_arg;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void wifi_notify_event(enum bk7258_wifi_event_e event,
                              unsigned int value)
{
  bk7258_wifi_event_cb_t callback;
  void *arg;

  nxmutex_lock(&g_wifi.event_lock);
  callback = g_wifi_event_callback;
  arg = g_wifi_event_arg;

  if (callback != NULL)
    {
      callback(event, value, arg);
    }

  nxmutex_unlock(&g_wifi.event_lock);
}

static_assert(sizeof(g_wifi.command_data) >=
               sizeof(struct bk7258_wifi_scan_page_response),
               "command response buffer must hold one scan page");
static_assert(sizeof(struct bk7258_wifi_scan_page_response) <= 256,
               "scan page must fit the short controller event");
static_assert(WIFI_SCAN_CACHE_LIMIT > 0 && WIFI_SCAN_CACHE_LIMIT <= 4096,
               "scan cache must be bounded to 4096 bytes");

static bool wifi_cp_range(uint32_t address, size_t length)
{
  return address >= BK7258_CP_RAM_START &&
         address <= BK7258_CP_RAM_END &&
         length <= (size_t)(BK7258_CP_RAM_END - address);
}

static bool wifi_cp_pointer(uint32_t address, size_t length)
{
  return (address & 3u) == 0 && wifi_cp_range(address, length);
}

static int wifi_send_node(uint8_t mailbox_channel, uint8_t node_channel,
                          uint32_t head, uint32_t tail, uint8_t count,
                          bk7258_mb_tx_complete_t callback, void *arg)
{
  struct bk7258_mb_wire_message message;
  struct bk7258_wifi_ipc_node node;

  memset(&node, 0, sizeof(node));
  node.head = head;
  node.tail = tail;
  node.channel = node_channel;
  node.num = count;
  memcpy(&message, &node, sizeof(message));
  __asm__ volatile("dmb sy" ::: "memory");
  return bk7258_mailbox_send_wire(mailbox_channel, &message, callback, arg);
}

static int wifi_send_node_async(uint8_t mailbox_channel,
                                const struct bk7258_wifi_ipc_node *node,
                                bk7258_mb_tx_complete_t callback, void *arg)
{
  struct bk7258_mb_wire_message message;

  memcpy(&message, node, sizeof(message));
  __asm__ volatile("dmb sy" ::: "memory");
  return bk7258_mailbox_send_wire(mailbox_channel, &message, callback, arg);
}

static struct wifi_command_slot *wifi_command_alloc(void)
{
  unsigned int i;

