open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
  for (i = 0; i < BK7258_WIFI_CMD_SLOTS; i++)
    {
      uint32_t *pattern = (uint32_t *)g_wifi.command[i].bytes;

      if (!g_wifi.command[i].owned &&
          !g_wifi.command[i].transport_pending &&
          *pattern == BK7258_WIFI_CMD_PATTERN_FREE)
        {
          g_wifi.command[i].owned = true;
          *pattern = BK7258_WIFI_CMD_PATTERN_BUSY;
          return &g_wifi.command[i];
        }
    }

  return NULL;
}

static void wifi_command_reap(void)
{
  unsigned int i;

  for (i = 0; i < BK7258_WIFI_CMD_SLOTS; i++)
    {
      uint32_t pattern = *(uint32_t *)g_wifi.command[i].bytes;

      if (g_wifi.command[i].owned &&
          !g_wifi.command[i].transport_pending &&
          pattern == BK7258_WIFI_CMD_PATTERN_FREE)
        {
          g_wifi.command[i].owned = false;
        }
    }
}

static void wifi_command_transport_complete(
  const struct bk7258_mb_wire_message *ack, int result, void *arg)
{
  struct wifi_command_slot *slot = arg;
  bool wake = false;
  irqstate_t flags;

  (void)ack;
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (slot->transport_pending)
    {
      slot->transport_pending = false;
      if (result == -EREMOTEIO && slot->owned)
        {
          *(uint32_t *)slot->bytes = BK7258_WIFI_CMD_PATTERN_FREE;
          slot->owned = false;
          if (g_wifi.waiting_id ==
                slot->command + BK7258_WIFI_CFM_OFFSET &&
              g_wifi.waiting_sequence == slot->sequence)
            {
              g_wifi.command_result = -EREMOTEIO;
              g_wifi.waiting_id = 0;
              wake = true;
            }
        }
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

  if (wake)
    {
      nxsem_post(&g_wifi.command_sem);
    }
}

static int wifi_command(uint16_t command, const void *payload,
                         uint16_t payload_length, void *result,
                         uint16_t result_size, uint16_t *result_length)
{
  struct wifi_command_slot *slot;
  struct bk7258_wifi_cpdu *cpdu;
  struct bk7258_wifi_msg_hdr *header;
  irqstate_t flags;
  uint16_t sequence;
  int ret;

  if (payload_length > BK7258_WIFI_CMD_SLOT_SIZE - sizeof(uint32_t) -
                       sizeof(*cpdu) - sizeof(*header))
    {
      return -E2BIG;
    }

  if (!bk7258_mailbox_link_ready())
    {
      return -ENOLINK;
    }

  nxmutex_lock(&g_wifi.command_lock);
  nxmutex_lock(&g_wifi.packet_lock);
  wifi_command_reap();
  slot = wifi_command_alloc();
  if (slot == NULL)
    {
      nxmutex_unlock(&g_wifi.packet_lock);
      nxmutex_unlock(&g_wifi.command_lock);
      return -ENOMEM;
    }

  cpdu = (struct bk7258_wifi_cpdu *)(slot->bytes + sizeof(uint32_t));
  header = (struct bk7258_wifi_msg_hdr *)(cpdu + 1);
  sequence = ++g_wifi.next_sequence;
  memset(cpdu, 0, sizeof(*cpdu) + sizeof(*header) + payload_length);
  cpdu->length = sizeof(*cpdu) + sizeof(*header) + payload_length;
  header->cmd_id = command;
  header->cmd_sn = sequence;
  header->length = payload_length;
  slot->command = command;
  slot->sequence = sequence;
  slot->generation = bk7258_mailbox_peer_reset_generation();
  slot->transport_pending = true;
  if (payload != NULL && payload_length != 0)
    {
      memcpy(header + 1, payload, payload_length);
    }

  while (nxsem_trywait(&g_wifi.command_sem) == OK)
    {
    }

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  g_wifi.waiting_id = command + BK7258_WIFI_CFM_OFFSET;
  g_wifi.waiting_sequence = sequence;
  g_wifi.command_result = -ETIMEDOUT;
  g_wifi.command_length = 0;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

  ret = wifi_send_node(BK7258_WIFI_CMD_TX_CHANNEL, 0,
                       (uint32_t)(uintptr_t)cpdu,
                       (uint32_t)(uintptr_t)cpdu, 1,
                       wifi_command_transport_complete, slot);
  if (ret < 0)
    {
      *(uint32_t *)slot->bytes = BK7258_WIFI_CMD_PATTERN_FREE;
      slot->owned = false;
      slot->transport_pending = false;
      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
      if (g_wifi.waiting_id == command + BK7258_WIFI_CFM_OFFSET &&
          g_wifi.waiting_sequence == sequence)
        {
          g_wifi.waiting_id = 0;
        }

      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

      nxmutex_unlock(&g_wifi.packet_lock);
      nxmutex_unlock(&g_wifi.command_lock);
      return ret;
    }

  nxmutex_unlock(&g_wifi.packet_lock);

  ret = nxsem_tickwait_uninterruptible(&g_wifi.command_sem,
                                       WIFI_COMMAND_TIMEOUT);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (g_wifi.waiting_id == command + BK7258_WIFI_CFM_OFFSET &&
      g_wifi.waiting_sequence == sequence)
    {
      g_wifi.waiting_id = 0;
    }

  if (ret >= 0)
    {
      ret = g_wifi.command_result;
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

  if (ret >= 0 && result != NULL && result_size != 0)
    {
      uint16_t copy = g_wifi.command_length < result_size ?
                      g_wifi.command_length : result_size;
      memcpy(result, g_wifi.command_data, copy);
    }

  if (ret >= 0 && result_length != NULL)
    {
      *result_length = g_wifi.command_length;
    }

  nxmutex_lock(&g_wifi.packet_lock);
  wifi_command_reap();
  nxmutex_unlock(&g_wifi.packet_lock);
  nxmutex_unlock(&g_wifi.command_lock);
  return ret;
}

static int wifi_ap_status_query(
  struct bk7258_wifi_ap_status_response *response)
{
  uint16_t result_length = 0;
  int ret;

#ifndef CONFIG_BK7258_WIFI_CP_EXTENSIONS
  return -ENOTSUP;
#endif

  memset(response, 0, sizeof(*response));
  ret = wifi_command(BK7258_WIFI_CMD_OPENVELA_AP_STATUS, NULL, 0,
                     response, sizeof(*response), &result_length);
  if (ret < 0)
    {
      return ret;
    }

  if (result_length != sizeof(*response) ||
      response->reserved[0] != 0 || response->reserved[1] != 0 ||
      response->started > 1 ||
      response->client_count > BK7258_WIFI_AP_MAX_CLIENTS ||
      response->security > BK7258_WIFI_AP_SECURITY_WPA2)
    {
      return -EPROTO;
    }

  return response->status;
}

static int wifi_sta_status_connected(bool *connected)
{
  uint8_t status = 0;
  uint16_t result_length = 0;
  int ret;

  ret = wifi_command(BK7258_WIFI_CMD_GET_WLAN_STATUS, NULL, 0,
                     &status, sizeof(status), &result_length);
  if (ret < 0)
    {
      return ret;
    }

