open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
  if (result_length < sizeof(status))
    {
      return -EPROTO;
    }

  *connected = status == WIFI_STA_STATUS_CONNECTED;
  return OK;
}

static void wifi_set_carrier(bool carrier)
{
  bool wake = false;
  irqstate_t flags;

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (g_wifi.carrier != carrier)
    {
      g_wifi.carrier = carrier;
      wake = true;
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  if (wake)
    {
      nxsem_post(&g_wifi.work_sem);
    }
}

static void wifi_notify_carrier(void)
{
  bool carrier;
  irqstate_t flags;

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (!g_wifi.initialized || g_wifi.carrier_notified == g_wifi.carrier)
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      return;
    }

  carrier = g_wifi.carrier;
  g_wifi.carrier_notified = carrier;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

  if (carrier)
    {
      netdev_lower_carrier_on(&g_wifi.lower);
    }
  else
    {
      netdev_lower_carrier_off(&g_wifi.lower);
    }
}

static uint8_t wifi_role_vif(enum wifi_role role)
{
  return role == WIFI_ROLE_SOFTAP ? BK7258_WIFI_WIRE_VIF_SOFTAP :
                                    BK7258_WIFI_WIRE_VIF_STA;
}

static bool wifi_tx_busy(void)
{
  unsigned int i;

  for (i = 0; i < CONFIG_BK7258_WIFI_TX_SLOTS; i++)
    {
      if (g_wifi.tx[i].active || g_wifi.tx[i].transport_pending)
        {
          return true;
        }
    }

  return false;
}

/* Give up the frames that are still only queued.
 *
 * Called with packet_lock and the driver spinlock held, from the paths that
 * invalidate whatever the frames were addressed to: a CP reset and the
 * interface going down.
 *
 * Safe in exactly the case the in-flight frames are not.  A queued frame was
 * never handed to the CP, so no DMA can be reading it and dropping it costs
 * a
 * retransmission rather than a use-after-free -- which is why the slots that
 * were handed over stay quarantined here, as they always have.
 *
 * The slots are marked rejected rather than freed, so the packets go out
 * through wifi_collect_rejected_tx() on the next worker pass.  netpkt_free()
 * belongs off these locks, and that path already does it that way.
 */

static void wifi_tx_pending_drop_locked(void)
{
  uint8_t index = g_wifi.tx_pend_head;
  unsigned int guard;

  for (guard = 0; guard <= CONFIG_BK7258_WIFI_TX_SLOTS &&
                  index != WIFI_TX_CHAIN_END; guard++)
    {
      struct wifi_tx_slot *tx = &g_wifi.tx[index];
      uint8_t next = tx->chain_next;

      tx->chain_next = WIFI_TX_CHAIN_END;
      tx->transport_pending = false;
      if (tx->active)
        {
          tx->transport_rejected = true;
        }

      index = next;
    }

  g_wifi.tx_pend_head = WIFI_TX_CHAIN_END;
  g_wifi.tx_pend_tail = WIFI_TX_CHAIN_END;
  g_wifi.tx_pend_num = 0;
}

/* Empty the receive queue into the caller's array.
 *
 * The queue used to be emptied by zeroing its indices, which was free when a
 * slot was a frame copy in static storage.  A slot now owns a netpkt, so
 * abandoning it leaks an IOB and a unit of the RX quota.  They cannot be
 * freed
 * here either: netpkt_free() belongs off the driver spinlock, the same
 * reason
 * wifi_tx_pending_drop_locked() marks slots instead of freeing them.  So the
 * pointers come out under the lock and the caller frees them once it is
 * gone.
 *
 * Caller holds packet_lock and the driver spinlock.  'out' must have room
 * for
 * WIFI_PACKET_QUEUE entries.
 */

static uint8_t wifi_rx_queue_take_locked(netpkt_t **out)
{
  uint8_t taken = 0;

  while (g_wifi.packet_count != 0)
    {
      out[taken++] = g_wifi.packets[g_wifi.packet_head].packet;
      g_wifi.packets[g_wifi.packet_head].packet = NULL;
      g_wifi.packet_head = (g_wifi.packet_head + 1) % WIFI_PACKET_QUEUE;
      g_wifi.packet_count--;
    }

  g_wifi.packet_head = 0;
  g_wifi.packet_tail = 0;
  return taken;
}

static void wifi_rx_queue_free(netpkt_t **packets, uint8_t count)
{
  while (count-- != 0)
    {
      if (packets[count] != NULL)
        {
          netpkt_free(&g_wifi.lower, packets[count], NETPKT_RX);
        }
    }
}

static void wifi_role_deactivate(enum wifi_role role)
{
  enum wifi_role deactivated_role = WIFI_ROLE_NONE;
  netpkt_t *orphans[WIFI_PACKET_QUEUE];
  uint8_t orphan_count = 0;
  bool deactivated = false;
  irqstate_t flags;

  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (role == WIFI_ROLE_NONE || g_wifi.active_role == role)
    {
      deactivated_role = g_wifi.active_role;
      g_wifi.active_role = WIFI_ROLE_NONE;
      g_wifi.role_state = WIFI_ROLE_IDLE;
      g_wifi.tx_gate = false;
      g_wifi.ap_started = false;
      g_wifi.ap_client_count = 0;
      g_wifi.role_epoch++;
      orphan_count = wifi_rx_queue_take_locked(orphans);
      deactivated = true;
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  wifi_rx_queue_free(orphans, orphan_count);
  if (deactivated)
    {
      nxsem_post(&g_wifi.role_sem);
      wifi_set_carrier(false);
      if (deactivated_role == WIFI_ROLE_SOFTAP)
        {
          wifi_notify_event(BK7258_WIFI_EVENT_AP_STOPPED, 0);
        }
    }
}

static void wifi_sta_event(bool connected, unsigned int reason)
{
  netpkt_t *orphans[WIFI_PACKET_QUEUE];
  uint8_t orphan_count = 0;
  bool carrier = false;
  bool handled = false;
  bool stopped = false;
  irqstate_t flags;

  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (g_wifi.active_role == WIFI_ROLE_STA)
    {
      handled = true;
      if (connected && g_wifi.role_state != WIFI_ROLE_STOPPING)
        {
          g_wifi.role_state = WIFI_ROLE_ACTIVE;
          g_wifi.tx_gate = g_wifi.admin_up;
          carrier = g_wifi.admin_up;
        }
      else if (!connected)
        {
          g_wifi.tx_gate = false;
          g_wifi.role_epoch++;
          orphan_count = wifi_rx_queue_take_locked(orphans);
          if (g_wifi.role_state == WIFI_ROLE_STOPPING)
            {
              g_wifi.active_role = WIFI_ROLE_NONE;
              g_wifi.role_state = WIFI_ROLE_IDLE;
              stopped = true;
            }
          else
            {
              /* CP auto-reconnect keeps the STA role alive after a transient
               * link loss.  The next connected event can restore carrier.
               */

              g_wifi.role_state = WIFI_ROLE_STARTING;
            }
        }
      else
        {
          /* Ignore a late connected indication from the role being
           * stopped.
           */

          handled = false;
        }
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  wifi_rx_queue_free(orphans, orphan_count);
  if (stopped)
    {
      nxsem_post(&g_wifi.role_sem);
    }

  if (handled)
    {
      wifi_set_carrier(carrier);
      wifi_notify_event(connected ? BK7258_WIFI_EVENT_STA_CONNECTED :
                                    BK7258_WIFI_EVENT_STA_DISCONNECTED,
                        connected ? 0 : reason);
    }
}

static void wifi_ap_start_event(bool started)
{
  netpkt_t *orphans[WIFI_PACKET_QUEUE];
  uint8_t orphan_count = 0;
  bool carrier = false;
  bool handled = false;
  bool stopped = false;
  irqstate_t flags;

  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (g_wifi.active_role == WIFI_ROLE_SOFTAP)
    {
      handled = true;
      if (started && g_wifi.role_state != WIFI_ROLE_STOPPING)
        {
          bool newly_started = g_wifi.role_state != WIFI_ROLE_ACTIVE ||
                               !g_wifi.ap_started;

          g_wifi.role_state = WIFI_ROLE_ACTIVE;
          g_wifi.ap_started = true;
          if (newly_started)
            {
              g_wifi.ap_client_count = 0;
            }

          g_wifi.tx_gate = g_wifi.admin_up;
          carrier = g_wifi.admin_up;
        }
      else if (!started)
        {
          g_wifi.active_role = WIFI_ROLE_NONE;
          g_wifi.role_state = WIFI_ROLE_IDLE;
          g_wifi.ap_started = false;
          g_wifi.ap_client_count = 0;
          g_wifi.tx_gate = false;
          g_wifi.role_epoch++;
          orphan_count = wifi_rx_queue_take_locked(orphans);
          stopped = true;
        }
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  wifi_rx_queue_free(orphans, orphan_count);
  if (stopped)
    {
      nxsem_post(&g_wifi.role_sem);
    }

  if (handled)
    {
      wifi_set_carrier(carrier);
      wifi_notify_event(started ? BK7258_WIFI_EVENT_AP_STARTED :
                                  BK7258_WIFI_EVENT_AP_STOPPED, 0);
    }
}

