open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
static void wifi_ap_client_event(bool associated)
{
  unsigned int client_count;
  irqstate_t flags;

  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (g_wifi.active_role == WIFI_ROLE_SOFTAP && g_wifi.ap_started &&
      g_wifi.role_state == WIFI_ROLE_ACTIVE)
    {
      if (associated &&
          g_wifi.ap_client_count < BK7258_WIFI_AP_MAX_CLIENTS)
        {
          g_wifi_rx_trace = 0;
          g_wifi_tx_trace = 0;
          g_wifi.ap_client_count++;
          printf("bk7258_wifi: AP client associated, count=%u\n",
                 g_wifi.ap_client_count);
        }
      else if (!associated && g_wifi.ap_client_count != 0)
        {
          g_wifi.ap_client_count--;
          printf("bk7258_wifi: AP client disassociated, count=%u\n",
                 g_wifi.ap_client_count);
        }
    }

  client_count = g_wifi.ap_client_count;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  wifi_notify_event(BK7258_WIFI_EVENT_AP_CLIENTS_CHANGED,
                    client_count);
}

static void wifi_scan_cache_clear(void)
{
  kmm_free(g_wifi.scan_cache);
  g_wifi.scan_cache = NULL;
  g_wifi.scan_cache_length = 0;
  g_wifi.scan_cached = false;
}

static void wifi_link_down_state(void)
{
  bool wake_command = false;
  irqstate_t flags;

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (g_wifi.waiting_id != 0)
    {
      g_wifi.command_result = -ECONNRESET;
      g_wifi.waiting_id = 0;
      wake_command = true;
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  if (wake_command)
    {
      nxsem_post(&g_wifi.command_sem);
    }

  wifi_role_deactivate(WIFI_ROLE_NONE);
  nxmutex_lock(&g_wifi.scan_lock);
  wifi_scan_cache_clear();
  g_wifi.scan_running = false;
  nxmutex_unlock(&g_wifi.scan_lock);
}

static bool wifi_sync_reset_generation(void)
{
  struct wifi_pending_node nodes[WIFI_NODE_QUEUE];
  uint32_t generation = bk7258_mailbox_peer_reset_generation();
  netpkt_t *orphans[WIFI_PACKET_QUEUE];
  uint8_t orphan_count = 0;
  bool wake_command = false;
  unsigned int kept = 0;
  unsigned int i;
  irqstate_t flags;

  if (generation == g_wifi.reset_generation)
    {
      return false;
    }

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (g_wifi.waiting_id != 0)
    {
      g_wifi.command_result = -ECONNRESET;
      g_wifi.waiting_id = 0;
      wake_command = true;
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  if (wake_command)
    {
      nxsem_post(&g_wifi.command_sem);
    }

  wifi_role_deactivate(WIFI_ROLE_NONE);
  nxmutex_lock(&g_wifi.scan_lock);
  wifi_scan_cache_clear();
  g_wifi.scan_running = false;
  nxmutex_unlock(&g_wifi.scan_lock);

  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  generation = bk7258_mailbox_peer_reset_generation();

  /* A peer generation change proves the old CP can no longer reference AP
   * command slots.  TX slots remain quarantined because DMA completion is
   * not proven by a CP reset.
   *
   * Queued frames are the exception, and the reason they are safe is the
   * same
   * reason the others are not: they were never handed over, so nothing on
   * the
   * far side can be reading them.  Keeping them would send frames addressed
   * to
   * a role that no longer exists.
   */

  wifi_tx_pending_drop_locked();

  for (i = 0; i < BK7258_WIFI_CMD_SLOTS; i++)
    {
      if (g_wifi.command[i].owned &&
          g_wifi.command[i].generation != generation)
        {
          *(uint32_t *)g_wifi.command[i].bytes =
            BK7258_WIFI_CMD_PATTERN_FREE;
          g_wifi.command[i].owned = false;
          g_wifi.command[i].transport_pending = false;
        }
    }

  g_wifi.reset_generation = generation;
  for (i = 0; i < g_wifi.node_count; i++)
    {
      unsigned int index = (g_wifi.node_head + i) % WIFI_NODE_QUEUE;

      if (g_wifi.nodes[index].generation == generation)
        {
          nodes[kept++] = g_wifi.nodes[index];
        }
    }

  memcpy(g_wifi.nodes, nodes, kept * sizeof(nodes[0]));
  g_wifi.node_head = 0;
  g_wifi.node_tail = kept % WIFI_NODE_QUEUE;
  g_wifi.node_count = kept;
  orphan_count = wifi_rx_queue_take_locked(orphans);
  for (i = 0; i < WIFI_RECYCLE_QUEUE; i++)
    {
      if (g_wifi.recycle[i].state != WIFI_RECYCLE_FREE &&
          g_wifi.recycle[i].generation != generation)
        {
          g_wifi.recycle[i].state = WIFI_RECYCLE_DISCARD;
        }
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  wifi_rx_queue_free(orphans, orphan_count);
  nxsem_post(&g_wifi.work_sem);
  return true;
}

static int wifi_scan_cache_append(const void *data, size_t length)
{
  if (length > WIFI_SCAN_CACHE_LIMIT - g_wifi.scan_cache_length)
    {
      return -E2BIG;
    }

  memcpy(g_wifi.scan_cache + g_wifi.scan_cache_length, data, length);
  g_wifi.scan_cache_length += length;
  return OK;
}

static int wifi_scan_cache_event(uint16_t command, const void *data,
                                 size_t length)
{
  struct iw_event event;

  memset(&event, 0, sizeof(event));
  event.cmd = command;
  event.len = offsetof(struct iw_event, u) + length;
  if (length > sizeof(event.u))
    {
      return -E2BIG;
    }

  memcpy(&event.u, data, length);
  return wifi_scan_cache_append(&event, event.len);
}

static int wifi_scan_cache_build_record(
  const struct bk7258_wifi_scan_record *record)
{
  struct iw_event event;
  struct iw_quality quality;
  struct iw_freq frequency;
  uint16_t flags;
  size_t ssid_length;
  size_t padded_length;
  size_t event_length;
  int ret;

  memset(&event, 0, sizeof(event));
  event.cmd = SIOCGIWAP;
  event.len = IW_EV_LEN(ap_addr);
  event.u.ap_addr.sa_family = ARPHRD_ETHER;
  memcpy(event.u.ap_addr.sa_data, record->bssid, sizeof(record->bssid));
  ret = wifi_scan_cache_append(&event, event.len);
  if (ret < 0)
    {
      return ret;
    }

  ssid_length = strnlen(record->ssid, sizeof(record->ssid));
  padded_length = (ssid_length + 3u) & ~3u;
  memset(&event, 0, sizeof(event));
  event.cmd = SIOCGIWESSID;
  event.u.essid.flags = IW_ESSID_ON;
  event.u.essid.length = ssid_length;
  event.u.essid.pointer = (void *)(uintptr_t)sizeof(struct iw_point);
  event_length = offsetof(struct iw_event, u) + sizeof(struct iw_point) +
                 padded_length;
  event.len = event_length;
  ret = wifi_scan_cache_append(&event, offsetof(struct iw_event, u) +
                               sizeof(struct iw_point));
  if (ret < 0)
    {
      return ret;
    }

  ret = wifi_scan_cache_append(record->ssid, ssid_length);
  if (ret < 0)
    {
      return ret;
    }

  if (padded_length != ssid_length)
    {
      uint32_t padding = 0;
      ret = wifi_scan_cache_append(&padding, padded_length - ssid_length);
      if (ret < 0)
        {
          return ret;
        }
    }

  memset(&quality, 0, sizeof(quality));
  quality.level = (uint8_t)record->rssi;
  quality.updated = IW_QUAL_DBM;
  ret = wifi_scan_cache_event(IWEVQUAL, &quality, sizeof(quality));
  if (ret < 0)
    {
      return ret;
    }

  memset(&frequency, 0, sizeof(frequency));
  frequency.m = record->channel;
  ret = wifi_scan_cache_event(SIOCGIWFREQ, &frequency, sizeof(frequency));
  if (ret < 0)
    {
      return ret;
    }

  flags = record->security == 0 ? IW_ENCODE_DISABLED : IW_ENCODE_ENABLED;
  memset(&event, 0, sizeof(event));
  event.cmd = SIOCGIWENCODE;
  event.len = IW_EV_LEN(data);
  event.u.data.flags = flags;
  return wifi_scan_cache_append(&event, event.len);
}

static int wifi_scan_cache_fetch(void)
{
  struct bk7258_wifi_scan_page_request request;
  struct bk7258_wifi_scan_page_response response;
  uint16_t start = 0;
  uint16_t total = 0;
  uint16_t result_length;
  int ret;

  g_wifi.scan_cache = kmm_malloc(WIFI_SCAN_CACHE_LIMIT);
  if (g_wifi.scan_cache == NULL)
    {
      return -ENOMEM;
    }

  do
    {
      memset(&request, 0, sizeof(request));
      request.start = start;
      request.max_records = BK7258_WIFI_SCAN_PAGE_RECORDS;
      memset(&response, 0, sizeof(response));
      ret = wifi_command(BK7258_WIFI_CMD_OPENVELA_SCAN_PAGE,
                         &request, sizeof(request), &response,
                         sizeof(response), &result_length);
      if (ret < 0)
        {
          printf("wifi scan page transport failed: %d\n", ret);
          wifi_scan_cache_clear();
          return ret;
        }

      if (result_length != sizeof(response) || response.status != 0 ||
          response.page.start != start ||
          response.page.count > BK7258_WIFI_SCAN_PAGE_RECORDS ||
          response.page.reserved != 0 ||
          response.page.total < start ||
          response.page.count > response.page.total - start)
        {
          printf("wifi scan page invalid: status=%ld start=%u count=%u "
                 "total=%u length=%u\n",
                 (long)response.status, response.page.start,
                 response.page.count, response.page.total, result_length);
          wifi_scan_cache_clear();
          return response.status != 0 ? response.status : -EPROTO;
        }

      if (start == 0)
        {
          total = response.page.total;
        }
      else if (response.page.total != total)
        {
          wifi_scan_cache_clear();
          return -EPROTO;
        }

      for (uint8_t i = 0; i < response.page.count; i++)
        {
          ret = wifi_scan_cache_build_record(&response.page.records[i]);
          if (ret < 0)
            {
              wifi_scan_cache_clear();
              return ret;
            }
        }

      start += response.page.count;
      if (response.page.more != (start < total) ||
          (response.page.count == 0 && start < total))
        {
          wifi_scan_cache_clear();
          return -EPROTO;
        }
    }
  while (start < total);

