open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
  g_wifi.scan_cached = true;
  return OK;
}

static void wifi_release_cp_command(uint32_t cpdu_address)
{
  uint32_t pattern_address = cpdu_address - sizeof(uint32_t);

  if (wifi_cp_pointer(pattern_address, sizeof(uint32_t)))
    {
      *(uint32_t *)(uintptr_t)pattern_address =
        BK7258_WIFI_CMD_PATTERN_FREE;
      __asm__ volatile("dmb sy" ::: "memory");
    }
}

static void wifi_handle_command(uint32_t cpdu_address,
                                uint32_t generation)
{
  struct bk7258_wifi_cpdu cpdu;
  struct bk7258_wifi_event_hdr event;
  uint8_t data[sizeof(g_wifi.command_data)];
  uint32_t event_address;
  uint16_t length;
  uint16_t copied;
  irqstate_t flags;

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (generation != bk7258_mailbox_peer_reset_generation() ||
      !wifi_cp_pointer(cpdu_address, sizeof(cpdu)))
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      return;
    }

  memcpy(&cpdu, (const void *)(uintptr_t)cpdu_address, sizeof(cpdu));
  event_address = cpdu_address + sizeof(cpdu);
  if (cpdu.length < sizeof(cpdu) + sizeof(event) ||
      !wifi_cp_range(event_address, sizeof(event)))
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      return;
    }

  memcpy(&event, (const void *)(uintptr_t)event_address, sizeof(event));
  length = event.length;
  if (length > cpdu.length - sizeof(cpdu) - sizeof(event) ||
      !wifi_cp_range(event_address + WIFI_EVENT_DATA_OFFSET, length))
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      return;
    }

  copied = length < sizeof(data) ? length : sizeof(data);
  if (copied != 0)
    {
      memcpy(data, (const void *)(uintptr_t)(event_address +
                                              WIFI_EVENT_DATA_OFFSET),
             copied);
    }

  wifi_release_cp_command(cpdu_address);
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

  if (event.id >= BK7258_WIFI_CFM_OFFSET)
    {
      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);

      if (event.id == g_wifi.waiting_id &&
          event.sequence == g_wifi.waiting_sequence)
        {
          if (copied != 0)
            {
              memcpy(g_wifi.command_data, data, copied);
            }

          g_wifi.command_length = copied;
          g_wifi.command_result = OK;
          g_wifi.waiting_id = 0;
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          nxsem_post(&g_wifi.command_sem);
        }
      else
        {
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
        }
    }
  else if (event.id == BK7258_WIFI_EVT_IPV4_IND)
    {
      wifi_sta_event(true, 0);
    }
  else if (event.id == BK7258_WIFI_EVT_WIFI_EVENT_IND && copied >= 4)
    {
      uint16_t event_id;
      uint16_t data_length;

      memcpy(&event_id, data, sizeof(event_id));
      memcpy(&data_length, data + sizeof(event_id), sizeof(data_length));
      if (event_id == BK7258_WIFI_EVENT_CONNECTED)
        {
          wifi_sta_event(true, 0);
        }
      else if (event_id == BK7258_WIFI_EVENT_DISCONNECTED)
        {
          unsigned int reason = 0;

          if (data_length >= sizeof(int32_t) &&
              copied >= 4 + sizeof(int32_t))
            {
              int32_t reported;

              memcpy(&reported, data + 4, sizeof(reported));
              reason = (unsigned int)reported;
            }

          wifi_sta_event(false, reason);
        }
    }
  else if (event.id == BK7258_WIFI_EVT_DISCONNECT_IND)
    {
      unsigned int reason = 0;

      if (copied >= sizeof(int32_t))
        {
          int32_t reported;

          memcpy(&reported, data, sizeof(reported));
          reason = (unsigned int)reported;
        }

      wifi_sta_event(false, reason);
    }
  else if (event.id == BK7258_WIFI_EVT_START_AP_IND && copied >= 1)
    {
      wifi_ap_start_event(data[0] == 0);
    }
  else if (event.id == BK7258_WIFI_EVT_ASSOC_AP_IND && copied >= 6)
    {
      wifi_ap_client_event(true);
    }
  else if (event.id == BK7258_WIFI_EVT_DISASSOC_AP_IND && copied >= 6)
    {
      wifi_ap_client_event(false);
    }
  else if (event.id == BK7258_WIFI_EVT_STOP_AP_IND)
    {
      wifi_role_deactivate(WIFI_ROLE_SOFTAP);
    }
  else if (event.id == BK7258_WIFI_EVT_SCAN_WIFI_IND)
    {
      g_wifi.scan_running = false;
    }
}

static bool wifi_validate_command(uint32_t cpdu_address,
                                  uint32_t *next, uint32_t generation)
{
  struct bk7258_wifi_cpdu cpdu;
  struct bk7258_wifi_event_hdr event;
  uint32_t event_address;
  irqstate_t flags;

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (generation != bk7258_mailbox_peer_reset_generation() ||
      !wifi_cp_pointer(cpdu_address, sizeof(cpdu)))
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      return false;
    }

  memcpy(&cpdu, (const void *)(uintptr_t)cpdu_address, sizeof(cpdu));
  event_address = cpdu_address + sizeof(cpdu);
  if (cpdu.length < sizeof(cpdu) + sizeof(event) ||
      !wifi_cp_range(event_address, sizeof(event)))
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      return false;
    }

  memcpy(&event, (const void *)(uintptr_t)event_address, sizeof(event));
  if (event.length > cpdu.length - sizeof(cpdu) - sizeof(event) ||
      !wifi_cp_range(event_address + WIFI_EVENT_DATA_OFFSET, event.length))
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      return false;
    }

  *next = cpdu.next;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  return true;
}

static void wifi_handle_command_list(const struct bk7258_wifi_ipc_node *node,
                                     uint32_t generation)
{
  uint32_t addresses[BK7258_WIFI_MAX_LIST];
  uint32_t address = node->head;
  unsigned int count;

  if (node->channel != 0 || node->num == 0 ||
      node->num > BK7258_WIFI_MAX_LIST)
    {
      return;
    }

  for (count = 0; count < node->num; count++)
    {
      uint32_t next;
      unsigned int previous;

      if (!wifi_validate_command(address, &next, generation))
        {
          return;
        }

      for (previous = 0; previous < count; previous++)
        {
          if (addresses[previous] == address)
            {
              return;
            }
        }

      if ((count + 1 == node->num) != (address == node->tail))
        {
          return;
        }

      addresses[count] = address;
      address = next;
    }

  if (address != 0)
    {
      return;
    }

  for (count = 0; count < node->num; count++)
    {
      if (generation != bk7258_mailbox_peer_reset_generation())
        {
          return;
        }

      wifi_handle_command(addresses[count], generation);
    }
}

static struct wifi_tx_slot *wifi_tx_slot(uint32_t cpdu_address)
{
  unsigned int i;

  for (i = 0; i < CONFIG_BK7258_WIFI_TX_SLOTS; i++)
    {
      struct bk7258_wifi_cpdu *cpdu =
        (struct bk7258_wifi_cpdu *)g_wifi.tx[i].headroom;

