open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
      if (cpdu_address == (uint32_t)(uintptr_t)cpdu)
        {
          return &g_wifi.tx[i];
        }
    }

  return NULL;
}

/* One acknowledgement resolves the whole batch that was handed over, so
 * every
 * slot in the in-flight chain is dealt with here rather than the single one
 * an
 * arg could name.
 *
 * Runs from the mailbox's acknowledgement path, which cannot take a mutex,
 * so
 * this touches only the driver spinlock and leaves sending the next batch to
 * the worker.  Posting the semaphore unconditionally is the point: it is the
 * re-kick the vendor's wdrv_tx_complete() performs when its tx_list is not
 * empty, except that here the worker is what decides whether there is one.
 */

static void wifi_tx_transport_complete(
  const struct bk7258_mb_wire_message *ack, int result, void *arg)
{
  unsigned int guard;
  irqstate_t flags;
  uint8_t index;

  (void)ack;
  (void)arg;

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  index = g_wifi.tx_sent_head;

  /* Bounded by the slot count as well as by the terminator.  A chain holds
   * each
   * slot at most once, so a longer walk would mean it had been corrupted,
   * and
   * spinning on that here would take the core down with interrupts disabled.
   */

  for (guard = 0; guard <= CONFIG_BK7258_WIFI_TX_SLOTS &&
                  index != WIFI_TX_CHAIN_END; guard++)
    {
      struct wifi_tx_slot *tx = &g_wifi.tx[index];
      uint8_t next = tx->chain_next;

      tx->chain_next = WIFI_TX_CHAIN_END;
      if (tx->transport_pending)
        {
          tx->transport_pending = false;

          /* -EREMOTEIO is the CP refusing the frame.  The slot still holds
           * the
           * packet, so it goes to wifi_collect_rejected_tx() exactly as a
           * single-frame transfer used to.
           */

          if (result == -EREMOTEIO && tx->active)
            {
              tx->transport_rejected = true;
            }
        }

      index = next;
    }

  g_wifi.tx_sent_head = WIFI_TX_CHAIN_END;
  g_wifi.tx_sent_num = 0;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

  nxsem_post(&g_wifi.work_sem);
}

/* Hand every frame that has accumulated to the CP as a single transaction.
 *
 * At most one batch per call: the mailbox carries one transaction at a time
 * across all of its channels, so a second would only be refused.  The caller
 * must hold packet_lock -- the order every other user of the TX slots takes,
 * and what makes the window below safe, since no frame can be appended while
 * the spinlock is dropped for the send.
 */

static void wifi_flush_tx(void)
{
  uint32_t head_address;
  uint32_t tail_address;
  unsigned int guard;
  irqstate_t flags;
  uint8_t high_water = 0;
  uint8_t tail_index;
  uint8_t index;
  uint8_t num;
  int ret;

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);

  /* tx_sent_num is the vendor's sending_flag: while a batch is outstanding
   * new
   * frames simply wait, and its acknowledgement starts the next one.
   */

  if (g_wifi.tx_sent_num != 0 || g_wifi.tx_pend_num == 0 ||
      !bk7258_mailbox_link_ready())
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      return;
    }

  index = g_wifi.tx_pend_head;
  tail_index = g_wifi.tx_pend_tail;
  num = g_wifi.tx_pend_num;
  head_address = (uint32_t)(uintptr_t)g_wifi.tx[index].headroom;
  tail_address = (uint32_t)(uintptr_t)g_wifi.tx[tail_index].headroom;

  g_wifi.tx_sent_head = index;
  g_wifi.tx_sent_num = num;
  g_wifi.tx_pend_head = WIFI_TX_CHAIN_END;
  g_wifi.tx_pend_tail = WIFI_TX_CHAIN_END;
  g_wifi.tx_pend_num = 0;

  /* Marked now rather than when the frame was queued, because until this
   * point
   * no transaction covered it and wifi_tx_busy() would have reported a frame
   * as
   * being in the mailbox when it was only waiting for it.
   */

  for (guard = 0; guard <= CONFIG_BK7258_WIFI_TX_SLOTS &&
                  index != WIFI_TX_CHAIN_END; guard++)
    {
      g_wifi.tx[index].transport_pending = true;
      index = g_wifi.tx[index].chain_next;
    }

  g_wifi.tx_batches++;
  g_wifi.tx_batched_frames += num;
  if (num > g_wifi.tx_batch_max)
    {
      g_wifi.tx_batch_max = num;
      high_water = num;
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

  /* Reported only when the batch beats every previous one, which bounds this
   * to
   * one line per attainable size -- at most CONFIG_BK7258_WIFI_TX_SLOTS for
   * the
   * life of the boot.  That is deliberate: the console shares the mailbox
   * with
   * these very frames, so anything that logged per batch would be measuring
   * itself.  tx_batches and tx_batched_frames carry the averages for a
   * debugger
   * or a future readout that does not go through the console.
   */

  if (high_water != 0)
    {
      printf("bk7258_wifi: TX batch reached %u frame(s)\n",
             (unsigned int)high_water);
    }

  ret = wifi_send_node(BK7258_WIFI_DATA_TX_CHANNEL, 2, head_address,
                       tail_address, num, wifi_tx_transport_complete, NULL);
  if (ret < 0)
    {
      /* Put the batch back instead of dropping it.  The upper half has
       * already
       * been told these frames were accepted, and a refused transaction is
       * backpressure rather than a delivery failure -- which is the
       * difference
       * from the code this replaces, where the error reached
       * netdev_upper_txpoll() and the packet was freed there.  Nothing can
       * have
       * queued behind them, because the caller still holds packet_lock.
       */

      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
      index = g_wifi.tx_sent_head;
      for (guard = 0; guard <= CONFIG_BK7258_WIFI_TX_SLOTS &&
                      index != WIFI_TX_CHAIN_END; guard++)
        {
          g_wifi.tx[index].transport_pending = false;
          index = g_wifi.tx[index].chain_next;
        }

      g_wifi.tx_pend_head = g_wifi.tx_sent_head;
      g_wifi.tx_pend_tail = tail_index;
      g_wifi.tx_pend_num = g_wifi.tx_sent_num;
      g_wifi.tx_sent_head = WIFI_TX_CHAIN_END;
      g_wifi.tx_sent_num = 0;
      g_wifi.tx_batches--;
      g_wifi.tx_batched_frames -= num;
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
    }
}

