open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
static void wifi_notify_network(struct wifi_net_notifications *notifications)
{
  unsigned int i;

  for (i = 0; i < notifications->tx_count; i++)
    {
      netpkt_free(&g_wifi.lower, notifications->tx_packets[i], NETPKT_TX);
      netdev_lower_txdone(&g_wifi.lower);
    }

  if (notifications->rxready)
    {
      netdev_lower_rxready(&g_wifi.lower);
    }
}

static void wifi_collect_rejected_tx(
  struct wifi_net_notifications *notifications)
{
  irqstate_t flags;
  unsigned int i;

  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  for (i = 0; i < CONFIG_BK7258_WIFI_TX_SLOTS; i++)
    {
      struct wifi_tx_slot *tx = &g_wifi.tx[i];

      if (tx->active && tx->transport_rejected)
        {
          /* Counted at the one place every rejected frame passes through,
           * whether the CP refused it or a reset dropped it while queued.
           */

          g_wifi.tx_rejected++;
          notifications->tx_packets[notifications->tx_count++] = tx->packet;
          tx->packet = NULL;
          tx->active = false;
          tx->transport_rejected = false;
        }
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
}

/* Validate a frame the CP has handed over and report where its payload is.
 *
 * It used to copy the payload into the caller's queue slot.  It only locates
 * it now, because the copy has to happen with the driver spinlock dropped:
 * netpkt_copyin() reaches iob_trycopyin(), which will take further buffers
 * from the IOB pool if it needs them, and that is not work for a section
 * with
 * interrupts disabled.  The caller re-checks the reset generation after
 * copying, so a CP that restarts mid-copy costs one dropped frame rather
 * than
 * a corrupt one.
 */

static bool wifi_locate_rx_frame(uint32_t cpdu_address,
                                 uint32_t *payload, uint16_t *length,
                                 uint8_t *vif)
{
  struct bk7258_wifi_cpdu cpdu;
  struct bk7258_wifi_pbuf pbuf;
  uint32_t pbuf_address;

  if (!wifi_cp_pointer(cpdu_address, sizeof(cpdu)) ||
      cpdu_address < BK7258_CP_RAM_START + sizeof(pbuf))
    {
      return false;
    }

  memcpy(&cpdu, (const void *)(uintptr_t)cpdu_address, sizeof(cpdu));
  pbuf_address = cpdu_address - sizeof(pbuf);
  if (!wifi_cp_pointer(pbuf_address, sizeof(pbuf)))
    {
      return false;
    }

  memcpy(&pbuf, (const void *)(uintptr_t)pbuf_address, sizeof(pbuf));
  if ((cpdu.flags & 1u) != 0 || pbuf.next != 0 || pbuf.len == 0 ||
      pbuf.len > BK7258_WIFI_MAX_FRAME || pbuf.tot_len != pbuf.len ||
      pbuf.ref == 0 || pbuf.ref == UINT8_MAX ||
      !wifi_cp_pointer(pbuf.payload, pbuf.len))
    {
      return false;
    }

  if (payload != NULL)
    {
      *payload = pbuf.payload;
    }

  if (length != NULL)
    {
      *length = (uint16_t)pbuf.len;
    }

  if (vif != NULL)
    {
      *vif = bk7258_wifi_cpdu_get_vif(cpdu.flags);
    }

  return true;
}

static void wifi_recycle_append(struct bk7258_wifi_ipc_node *node,
                                uint32_t cpdu_address)
{
  struct bk7258_wifi_cpdu *cpdu =
    (struct bk7258_wifi_cpdu *)(uintptr_t)cpdu_address;
  uint32_t pbuf_address;
  struct bk7258_wifi_pbuf *pbuf;

  pbuf_address = cpdu_address - sizeof(*pbuf);
  pbuf = (struct bk7258_wifi_pbuf *)(uintptr_t)pbuf_address;

  /* Match wdrv_txdata_sender(): CP drops one reference before pbuf_free(). */

  pbuf->ref++;
  cpdu->flags |= 1u;
  cpdu->next = 0;
  if (node->tail != 0)
    {
      ((struct bk7258_wifi_cpdu *)(uintptr_t)node->tail)->next =
        cpdu_address;
    }
  else
    {
      node->head = cpdu_address;
    }

  node->tail = cpdu_address;
  node->num++;
}

static void wifi_recycle_complete(
  const struct bk7258_mb_wire_message *ack, int result, void *arg)
{
  struct wifi_recycle_entry *entry = arg;
  irqstate_t flags = rspin_lock_irqsave(&g_bk7258_driver_lock);

  (void)ack;
  if (entry->state == WIFI_RECYCLE_SENDING)
    {
      if (result == OK || entry->generation !=
          bk7258_mailbox_peer_reset_generation())
        {
          entry->state = WIFI_RECYCLE_DISCARD;
        }
      else
        {
          entry->state = WIFI_RECYCLE_QUEUED;
        }
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxsem_post(&g_wifi.work_sem);
}

static void wifi_flush_recycle(void)
{
  struct wifi_recycle_entry *entry;
  irqstate_t flags;
  int ret;

  for (; ; )
    {
      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
      if (g_wifi.recycle_count == 0)
        {
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          return;
        }

      entry = &g_wifi.recycle[g_wifi.recycle_head];
      if (entry->generation != g_wifi.reset_generation)
        {
          entry->state = WIFI_RECYCLE_DISCARD;
        }

      if (entry->state == WIFI_RECYCLE_DISCARD)
        {
          memset(entry, 0, sizeof(*entry));
          g_wifi.recycle_head = (g_wifi.recycle_head + 1) %
                                WIFI_RECYCLE_QUEUE;
          g_wifi.recycle_count--;
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          bk7258_mbox_kick_rx();
          continue;
        }

      if (entry->state != WIFI_RECYCLE_QUEUED ||
          !bk7258_mailbox_link_ready())
        {
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          return;
        }

      entry->state = WIFI_RECYCLE_SENDING;
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      ret = wifi_send_node_async(BK7258_WIFI_DATA_TX_CHANNEL, &entry->node,
                                 wifi_recycle_complete, entry);
      if (ret < 0)
        {
          flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
          if (entry->state == WIFI_RECYCLE_SENDING)
            {
              entry->state = WIFI_RECYCLE_QUEUED;
            }

          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
        }

      return;
    }
}

static void wifi_handle_data(const struct wifi_pending_node *pending,
                             struct wifi_net_notifications *notifications)
{
  const struct bk7258_wifi_ipc_node *node = &pending->node;
  uint32_t addresses[BK7258_WIFI_MAX_LIST];
  bool cp_owned[BK7258_WIFI_MAX_LIST];
  struct wifi_recycle_entry *recycle;
  uint32_t address = node->head;
  uint8_t packet_added = 0;
  unsigned int received = 0;
  unsigned int count;
  irqstate_t flags;

  if (!pending->recycle_reserved || node->channel != 2 ||
      node->num == 0 || node->num > BK7258_WIFI_MAX_LIST)
    {
      return;
    }

  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  recycle = &g_wifi.recycle[pending->recycle_index];
  if (pending->generation != g_wifi.reset_generation ||
      pending->generation != bk7258_mailbox_peer_reset_generation())
    {
      recycle->state = WIFI_RECYCLE_DISCARD;
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      nxmutex_unlock(&g_wifi.packet_lock);
      return;
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

  /* First pass validates the complete list without changing either core's
   * ownership.  A malformed list is left untouched.
   */

  for (count = 0; count < node->num; count++)
    {
      struct bk7258_wifi_cpdu cpdu;
      struct wifi_tx_slot *tx;
      uint32_t next;
      unsigned int previous;

      if (address == 0)
        {
          goto invalid;
        }

      for (previous = 0; previous < count; previous++)
        {
          if (addresses[previous] == address)
            {
              goto invalid;
            }
        }

      if ((count + 1 == node->num) != (address == node->tail))
        {
          goto invalid;
        }

      addresses[count] = address;
      tx = wifi_tx_slot(address);
      if (tx != NULL)
        {
          struct bk7258_wifi_cpdu *ap_cpdu =
            (struct bk7258_wifi_cpdu *)tx->headroom;

