open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
          if (!tx->active || (ap_cpdu->flags & 1u) == 0 ||
              bk7258_wifi_cpdu_get_vif(ap_cpdu->flags) != tx->vif)
            {
              goto invalid;
            }

          /* Completion is accepted by slot address even after role_epoch
           * changes.  A role cannot start while any TX slot is busy, and
           * rejecting a late completion here would leak the retained packet.
           */

          cp_owned[count] = false;
          next = ap_cpdu->next;
        }
      else
        {
          flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
          if (pending->generation !=
                bk7258_mailbox_peer_reset_generation() ||
              !wifi_cp_pointer(address, sizeof(cpdu)) ||
              !wifi_locate_rx_frame(address, NULL, NULL, NULL))
            {
              rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
              goto invalid;
            }

          memcpy(&cpdu, (const void *)(uintptr_t)address, sizeof(cpdu));
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          cp_owned[count] = true;
          next = cpdu.next;
        }

      address = next;
    }

  if (address != 0)
    {
      goto invalid;
    }

  /* A channel 2 list mixes both directions: an entry that resolves to one of
   * our own TX slots is that buffer coming back, and only the rest are
   * frames the peer sent.  Counting the whole list as received would inflate
   * it by however many frames were transmitted, which on a download is very
   * nearly one per segment acknowledged.
   */

  for (count = 0; count < node->num; count++)
    {
      if (cp_owned[count])
        {
          received++;
        }
    }

  g_wifi.rx_lists++;
  g_wifi.rx_listed_frames += received;
  g_wifi.tx_completions += node->num - received;
  if (received > g_wifi.rx_list_max)
    {
      g_wifi.rx_list_max = (uint8_t)received;
    }

  for (count = 0; count < node->num; count++)
    {
      uint32_t payload = 0;
      uint16_t length = 0;
      uint8_t vif = 0;
      netpkt_t *pkt;
      bool usable;

      if (!cp_owned[count])
        {
          continue;
        }

      /* packet_count is stable here: every function that changes it holds
       * packet_lock, which this one holds for its whole length.
       */

      if (g_wifi.packet_count + packet_added >= WIFI_PACKET_QUEUE)
        {
          /* Nowhere to put it, and the CP has already been told the list was
           * taken, so this is a frame lost where nothing else would say so.
           */

          g_wifi.rx_queue_full++;
          continue;
        }

      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
      usable = pending->generation ==
                 bk7258_mailbox_peer_reset_generation() &&
               pending->role_epoch == g_wifi.role_epoch &&
               g_wifi.role_state == WIFI_ROLE_ACTIVE &&
               g_wifi.active_role != WIFI_ROLE_NONE &&
               wifi_locate_rx_frame(addresses[count], &payload, &length,
                                    &vif) &&
               vif == wifi_role_vif(g_wifi.active_role);
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      if (!usable)
        {
          continue;
        }

      pkt = netpkt_alloc(&g_wifi.lower, NETPKT_RX);
      if (pkt == NULL)
        {
          /* Out of read-ahead buffers or out of RX quota.  Nothing is wrong
           * with the frame; the window advertised through
           * tcp_get_recvwindow() shrinks with the same IOB count, so a
           * sender should already be easing off before this becomes common.
           */

          g_wifi.rx_alloc_fail++;
          continue;
        }

      if (netpkt_copyin(&g_wifi.lower, pkt,
                        (const uint8_t *)(uintptr_t)payload, length, 0) < 0)
        {
          netpkt_free(&g_wifi.lower, pkt, NETPKT_RX);
          g_wifi.rx_alloc_fail++;
          continue;
        }

      if (g_wifi_rx_trace < 16)
        {
          const uint8_t *frame = (const uint8_t *)(uintptr_t)payload;
          uint16_t type = length >= 14 ?
                          ((uint16_t)frame[12] << 8) | frame[13] : 0;

          printf("bk7258_wifi: AP RX vif=%u len=%u eth=0x%04x\n",
                 vif, length, type);
          g_wifi_rx_trace++;
        }

      /* The copy ran with the spinlock dropped, so the source is only known
       * to have been the validated one if nothing has reset since.
       */

      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
      if (pending->generation == bk7258_mailbox_peer_reset_generation() &&
          pending->role_epoch == g_wifi.role_epoch)
        {
          unsigned int index = (g_wifi.packet_tail + packet_added) %
                               WIFI_PACKET_QUEUE;

          g_wifi.packets[index].packet = pkt;
          g_wifi.packets[index].role_epoch = pending->role_epoch;
          packet_added++;
          pkt = NULL;
        }

      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

      if (pkt != NULL)
        {
          netpkt_free(&g_wifi.lower, pkt, NETPKT_RX);
        }
    }

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (pending->generation != bk7258_mailbox_peer_reset_generation())
    {
      recycle->state = WIFI_RECYCLE_DISCARD;
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      nxmutex_unlock(&g_wifi.packet_lock);
      return;
    }

  memset(&recycle->node, 0, sizeof(recycle->node));
  recycle->node.channel = 2;
  for (count = 0; count < node->num; count++)
    {
      if (cp_owned[count] &&
          recycle->node.num < BK7258_WIFI_MAX_LIST)
        {
          wifi_recycle_append(&recycle->node, addresses[count]);
        }
    }

  __asm__ volatile("dmb sy" ::: "memory");
  recycle->state = recycle->node.num == 0 ? WIFI_RECYCLE_DISCARD :
                                            WIFI_RECYCLE_QUEUED;
  g_wifi.packet_tail = (g_wifi.packet_tail + packet_added) %
                       WIFI_PACKET_QUEUE;
  g_wifi.packet_count += packet_added;

  for (count = 0; count < node->num; count++)
    {
      if (!cp_owned[count])
        {
          struct wifi_tx_slot *tx = wifi_tx_slot(addresses[count]);

          notifications->tx_packets[notifications->tx_count++] = tx->packet;
          tx->packet = NULL;
          tx->active = false;
          tx->transport_rejected = false;
        }
    }

  if (packet_added != 0)
    {
      notifications->rxready = true;
    }

  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  nxsem_post(&g_wifi.work_sem);
  return;

invalid:
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  recycle->state = WIFI_RECYCLE_DISCARD;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
}

static int wifi_mailbox_rx(const struct bk7258_mb_wire_message *message,
                           uint8_t *ack_flags, void *arg)
{
  struct bk7258_wifi_ipc_node node;
  struct wifi_pending_node *pending;
  irqstate_t flags;

