open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
  (void)ack_flags;
  (void)arg;
  memcpy(&node, message, sizeof(node));
  if (node.num == 0 || node.num > BK7258_WIFI_MAX_LIST)
    {
      return -EINVAL;
    }

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (g_wifi.node_count == WIFI_NODE_QUEUE ||
      (node.channel == 2 &&
       g_wifi.recycle_count == WIFI_RECYCLE_QUEUE))
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      return -EAGAIN;
    }

  pending = &g_wifi.nodes[g_wifi.node_tail];
  memset(pending, 0, sizeof(*pending));
  pending->node = node;
  pending->generation = bk7258_mailbox_peer_reset_generation();
  pending->role_epoch = g_wifi.role_epoch;
  if (node.channel == 2)
    {
      struct wifi_recycle_entry *entry =
        &g_wifi.recycle[g_wifi.recycle_tail];

      memset(entry, 0, sizeof(*entry));
      entry->generation = pending->generation;
      entry->state = WIFI_RECYCLE_RESERVED;
      pending->recycle_index = g_wifi.recycle_tail;
      pending->recycle_reserved = true;
      g_wifi.recycle_tail = (g_wifi.recycle_tail + 1) %
                            WIFI_RECYCLE_QUEUE;
      g_wifi.recycle_count++;
    }

  g_wifi.node_tail = (g_wifi.node_tail + 1) % WIFI_NODE_QUEUE;
  g_wifi.node_count++;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxsem_post(&g_wifi.work_sem);
  return OK;
}

static void wifi_link_changed(enum bk7258_mb_link_state state, void *arg)
{
  (void)arg;
  if (state != BK7258_MB_LINK_READY)
    {
      wifi_link_down_state();
    }

  (void)wifi_sync_reset_generation();
}

static int wifi_worker(int argc, char **argv)
{
  (void)argc;
  (void)argv;
  g_worker_result = OK;
  nxsem_post(&g_wifi.ready_sem);

  for (; ; )
    {
      struct wifi_pending_node pending;
      struct wifi_net_notifications notifications;
      irqstate_t flags;

      (void)nxsem_tickwait_uninterruptible(&g_wifi.work_sem,
                                           WIFI_WORK_INTERVAL);
      memset(&notifications, 0, sizeof(notifications));
      (void)wifi_sync_reset_generation();
      wifi_collect_rejected_tx(&notifications);
      wifi_flush_recycle();

      /* The outgoing batch.  Reached both from the acknowledgement of the
       * previous one, which posts work_sem, and from this loop's own timeout
       * --
       * so a chain left waiting because the mailbox was down or busy is
       * retried
       * every WIFI_WORK_INTERVAL rather than waiting for the next frame to
       * arrive and push it.
       */

      nxmutex_lock(&g_wifi.packet_lock);
      wifi_flush_tx();
      nxmutex_unlock(&g_wifi.packet_lock);
      for (; ; )
        {
          if (bk7258_mailbox_peer_reset_generation() !=
              g_wifi.reset_generation)
            {
              (void)wifi_sync_reset_generation();
            }

          nxmutex_lock(&g_wifi.packet_lock);
          flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
          if (g_wifi.node_count == 0)
            {
              rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
              nxmutex_unlock(&g_wifi.packet_lock);
              break;
            }

          pending = g_wifi.nodes[g_wifi.node_head];
          g_wifi.node_head = (g_wifi.node_head + 1) % WIFI_NODE_QUEUE;
          g_wifi.node_count--;
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          nxmutex_unlock(&g_wifi.packet_lock);
          if (pending.generation != g_wifi.reset_generation)
            {
              if (pending.recycle_reserved)
                {
                  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
                  g_wifi.recycle[pending.recycle_index].state =
                    WIFI_RECYCLE_DISCARD;
                  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
                }
            }
          else if (pending.node.channel == 0)
            {
              wifi_handle_command_list(&pending.node,
                                       pending.generation);
            }
          else if (pending.node.channel == 2)
            {
              wifi_handle_data(&pending, &notifications);
            }

          bk7258_mbox_kick_rx();
        }

      wifi_flush_recycle();
      wifi_notify_network(&notifications);
      wifi_notify_carrier();
    }

  return OK;
}

static int wifi_ifup(struct netdev_lowerhalf_s *lower)
{
  bool carrier;
  irqstate_t flags;

  (void)lower;
  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  g_wifi.admin_up = true;
  carrier = g_wifi.role_state == WIFI_ROLE_ACTIVE &&
            (g_wifi.active_role == WIFI_ROLE_STA || g_wifi.ap_started);
  g_wifi.tx_gate = carrier;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  wifi_set_carrier(carrier);
  return OK;
}

static int wifi_stop_active_role(void)
{
  struct bk7258_wifi_ap_status_response ap_status;
  enum wifi_role role;
  enum wifi_role_state previous_state;
  int32_t status = 0;
  uint16_t result_length = 0;
  irqstate_t flags;
  int ret;

  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  role = g_wifi.active_role;
  if (role == WIFI_ROLE_NONE)
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      nxmutex_unlock(&g_wifi.packet_lock);
      wifi_set_carrier(false);
      return OK;
    }

  if (g_wifi.role_state == WIFI_ROLE_STOPPING)
    {
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      nxmutex_unlock(&g_wifi.packet_lock);
      return -EBUSY;
    }

  previous_state = g_wifi.role_state;
  g_wifi.role_state = WIFI_ROLE_STOPPING;
  g_wifi.tx_gate = false;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  wifi_set_carrier(false);
  while (nxsem_trywait(&g_wifi.role_sem) == OK)
    {
    }

  if (role == WIFI_ROLE_STA)
    {
      ret = wifi_command(BK7258_WIFI_CMD_DISCONNECT, NULL, 0,
                         NULL, 0, NULL);
    }
  else
    {
      ret = wifi_command(BK7258_WIFI_CMD_OPENVELA_AP_STOP, NULL, 0,
                         &status, sizeof(status), &result_length);
      if (ret >= 0 && result_length != sizeof(status))
        {
          ret = -EPROTO;
        }
      else if (ret >= 0 && status != 0)
        {
          ret = status;
        }

      if (ret >= 0)
        {
          ret = wifi_ap_status_query(&ap_status);
          if (ret >= 0 && !ap_status.started)
            {
              wifi_role_deactivate(WIFI_ROLE_SOFTAP);
              return OK;
            }
        }
    }

  if (ret >= 0)
    {
      ret = nxsem_tickwait_uninterruptible(&g_wifi.role_sem,
                                            WIFI_ROLE_STOP_TIMEOUT);
    }

  if (ret == -ETIMEDOUT && role == WIFI_ROLE_STA)
    {
      bool connected;

      if (wifi_sta_status_connected(&connected) == OK && !connected)
        {
          wifi_role_deactivate(WIFI_ROLE_STA);
          return OK;
        }
    }

