open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
  if (ret < 0)
    {
      bool carrier;

      nxmutex_lock(&g_wifi.packet_lock);
      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
      if (g_wifi.active_role == role &&
          g_wifi.role_state == WIFI_ROLE_STOPPING && ret != -ETIMEDOUT)
        {
          g_wifi.role_state = previous_state;
          g_wifi.tx_gate = previous_state == WIFI_ROLE_ACTIVE &&
                           g_wifi.admin_up &&
                           (role == WIFI_ROLE_STA || g_wifi.ap_started);
        }

      carrier = g_wifi.tx_gate;
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      nxmutex_unlock(&g_wifi.packet_lock);
      wifi_set_carrier(carrier);
    }

  return ret;
}

static int wifi_ifdown(struct netdev_lowerhalf_s *lower)
{
  irqstate_t flags;
  int ret;

  (void)lower;
  ret = wifi_stop_active_role();
  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  g_wifi.admin_up = false;
  g_wifi.tx_gate = false;

  /* Closing tx_gate stops new frames, but whatever had accumulated would
   * otherwise sit in the chain until the interface came back up and then go
   * out
   * against whatever role it found.
   */

  wifi_tx_pending_drop_locked();
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  wifi_set_carrier(false);
  return ret;
}

static int wifi_transmit(struct netdev_lowerhalf_s *lower, netpkt_t *packet)
{
  struct wifi_tx_slot *tx = NULL;
  struct wifi_tx_slot *prev;
  struct bk7258_wifi_cpdu *cpdu;
  irqstate_t flags;
  uint8_t vif;
  uint8_t self;
  uint32_t role_epoch;
  unsigned int length;
  unsigned int i;
  int ret;

  nxmutex_lock(&g_wifi.packet_lock);
  length = netpkt_getdatalen(lower, packet);
  if (!g_wifi.carrier || !g_wifi.tx_gate ||
      g_wifi.role_state != WIFI_ROLE_ACTIVE ||
      g_wifi.active_role == WIFI_ROLE_NONE ||
      !bk7258_mailbox_link_ready())
    {
      g_wifi.tx_enetdown++;
      nxmutex_unlock(&g_wifi.packet_lock);
      return -ENETDOWN;
    }

  if (length == 0 || length > BK7258_WIFI_MAX_FRAME)
    {
      nxmutex_unlock(&g_wifi.packet_lock);
      return -EMSGSIZE;
    }

  for (i = 0; i < CONFIG_BK7258_WIFI_TX_SLOTS; i++)
    {
      if (!g_wifi.tx[i].active && !g_wifi.tx[i].transport_pending)
        {
          tx = &g_wifi.tx[i];
          break;
        }
    }

  if (tx == NULL)
    {
      g_wifi.tx_slots_full++;
      printf("bk7258_wifi: AP TX slots exhausted\n");
      nxmutex_unlock(&g_wifi.packet_lock);
      return -EBUSY;
    }

  memset(&tx->pbuf, 0, sizeof(tx->pbuf));
  cpdu = (struct bk7258_wifi_cpdu *)tx->headroom;
  memset(cpdu, 0, sizeof(*cpdu));
  vif = wifi_role_vif(g_wifi.active_role);
  role_epoch = g_wifi.role_epoch;
  tx->pbuf.payload = (uint32_t)(uintptr_t)tx->frame;
  tx->pbuf.tot_len = length;
  tx->pbuf.len = length;
  tx->pbuf.type_internal = WIFI_PBUF_TYPE_RAM;
  tx->pbuf.ref = 1;
  cpdu->length = sizeof(*cpdu) + length;
  cpdu->type_dst = 2u;
  cpdu->flags = bk7258_wifi_cpdu_set_vif(cpdu->flags, vif);
  ret = netpkt_copyout(lower, tx->frame, packet, length, 0);
  if (ret < 0)
    {
      nxmutex_unlock(&g_wifi.packet_lock);
      return ret;
    }

  if (g_wifi.active_role == WIFI_ROLE_SOFTAP && g_wifi_tx_trace < 16)
    {
      uint16_t type = length >= 14 ?
                      ((uint16_t)tx->frame[12] << 8) | tx->frame[13] : 0;

      printf("bk7258_wifi: AP TX vif=%u len=%u eth=0x%04x\n",
             vif, length, type);
      g_wifi_tx_trace++;
    }

  tx->packet = packet;
  tx->active = true;
  tx->transport_pending = false;
  tx->transport_rejected = false;
  tx->vif = vif;
  tx->role_epoch = role_epoch;

  /* Append to the outgoing chain rather than starting a transaction of its
   * own.
   *
   * Both links are written here: the index chain this driver walks, and the
   * cpdu's next pointer that the CP walks.  Only this function writes
   * either,
   * and it holds packet_lock, so no ordering barrier is needed until the
   * send
   * itself -- wifi_send_node() issues one.
   */

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  self = (uint8_t)(tx - &g_wifi.tx[0]);
  cpdu->next = 0;
  tx->chain_next = WIFI_TX_CHAIN_END;

  if (g_wifi.tx_pend_num == 0)
    {
      g_wifi.tx_pend_head = self;
    }
  else
    {
      prev = &g_wifi.tx[g_wifi.tx_pend_tail];
      ((struct bk7258_wifi_cpdu *)prev->headroom)->next =
        (uint32_t)(uintptr_t)cpdu;
      prev->chain_next = self;
    }

  g_wifi.tx_pend_tail = self;
  g_wifi.tx_pend_num++;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

  /* Tries to send immediately, and does nothing if a batch is already in
   * flight -- in which case this frame goes out with the next one, which is
   * where the saving comes from.  The packet now belongs to the driver
   * either
   * way, so this returns OK: netdev_ops_s documents that as the contract for
   * taking a packet onto a driver queue, and returning an error instead
   * would
   * have netdev_upper_txpoll() free a frame that is still chained here.
   */

  wifi_flush_tx();
  nxmutex_unlock(&g_wifi.packet_lock);
  return OK;
}

/* Hand the upper half the packet at the head of the queue.
 *
 * There is nothing to allocate or copy here any more: wifi_handle_data() has
 * already put the frame in a netpkt, so this only dequeues one.  Packets
 * left
 * behind by a role that has since changed are freed as they are passed over,
 * which is why the loop runs at all.
 */

static netpkt_t *wifi_receive(struct netdev_lowerhalf_s *lower)
{
  netpkt_t *packet = NULL;
  irqstate_t flags;

  nxmutex_lock(&g_wifi.packet_lock);

  for (; ; )
    {
      netpkt_t *stale = NULL;

      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
      if (g_wifi.packet_count == 0)
        {
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          break;
        }

      if (g_wifi.packets[g_wifi.packet_head].role_epoch !=
          g_wifi.role_epoch)
        {
          stale = g_wifi.packets[g_wifi.packet_head].packet;
        }
      else if (g_wifi.active_role == WIFI_ROLE_NONE ||
               g_wifi.role_state != WIFI_ROLE_ACTIVE)
        {
          /* The head is current but the interface is not carrying traffic;
           * leave it queued rather than dropping it, exactly as before.
           */

          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          break;
        }
      else
        {
          packet = g_wifi.packets[g_wifi.packet_head].packet;
        }

      g_wifi.packets[g_wifi.packet_head].packet = NULL;
      g_wifi.packet_head = (g_wifi.packet_head + 1) % WIFI_PACKET_QUEUE;
      g_wifi.packet_count--;
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);

