open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
      if (stale == NULL)
        {
          break;
        }

      netpkt_free(lower, stale, NETPKT_RX);
    }

  nxmutex_unlock(&g_wifi.packet_lock);
  return packet;
}

#ifdef CONFIG_NETDEV_IOCTL
static int wifi_ioctl(struct netdev_lowerhalf_s *lower, int command,
                      unsigned long arg)
{
  (void)lower;
  (void)command;
  (void)arg;
  return -ENOTTY;
}
#endif

#ifdef CONFIG_NETDEV_WIRELESS_HANDLER
static int wifi_connect(struct netdev_lowerhalf_s *lower)
{
  struct bk7258_wifi_ap_status_response ap_status;
  uint8_t payload[33 + 64];
  struct bk7258_wifi_ap_start_request request;
  struct wifi_role_config config;
  enum wifi_role role;
  int32_t status = 0;
  uint16_t result_length = 0;
  size_t ssid_length;
  size_t password_length;
  bool restart;
  irqstate_t flags;
  int ret;

  (void)lower;
  /* A new ESSID request is an explicit restart, including while the CP is
   * retrying a lost STA link. Stop the old role before replacing it.
   */

  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  restart = g_wifi.configured_role == WIFI_ROLE_STA &&
            g_wifi.active_role == WIFI_ROLE_STA && g_wifi.admin_up;
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  if (restart)
    {
      ret = wifi_stop_active_role();
      if (ret < 0)
        {
          return ret;
        }
    }

  nxmutex_lock(&g_wifi.packet_lock);
  flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
  if (!g_wifi.admin_up)
    {
      ret = -ENETDOWN;
      goto connect_unlock;
    }

  if (g_wifi.active_role != WIFI_ROLE_NONE ||
      g_wifi.role_state != WIFI_ROLE_IDLE || wifi_tx_busy())
    {
      ret = -EBUSY;
      goto connect_unlock;
    }

  role = g_wifi.configured_role;
  config = role == WIFI_ROLE_STA ? g_wifi.sta_config : g_wifi.ap_config;
  if (role == WIFI_ROLE_STA)
    {
      ssid_length = strnlen(config.ssid, sizeof(config.ssid));
      password_length = strnlen(config.password, sizeof(config.password));
    }
  else
    {
      ssid_length = strnlen(config.ssid, sizeof(config.ssid));
      password_length = strnlen(config.password, sizeof(config.password));
      if (ssid_length == 0 || config.channel < 1 || config.channel > 14 ||
          (config.wpa_version == IW_AUTH_WPA_VERSION_DISABLED &&
           (config.cipher != IW_AUTH_CIPHER_NONE ||
            password_length != 0)) ||
          (config.wpa_version == IW_AUTH_WPA_VERSION_WPA2 &&
           (config.cipher != IW_AUTH_CIPHER_CCMP ||
            password_length < 8 || password_length > 63)))
        {
          ret = -EINVAL;
          goto connect_unlock;
        }
    }

  g_wifi.active_role = role;
  g_wifi.role_state = WIFI_ROLE_STARTING;
  g_wifi.ap_started = false;
  g_wifi.ap_client_count = 0;
  g_wifi.tx_gate = false;
  g_wifi.role_epoch++;
  memcpy(g_wifi.lower.netdev.d_mac.ether.ether_addr_octet,
         role == WIFI_ROLE_STA ? g_wifi.sta_mac : g_wifi.ap_mac,
         sizeof(g_wifi.sta_mac));
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);

  if (role == WIFI_ROLE_STA)
    {
      bool auto_reconnect = true;

      ret = wifi_command(BK7258_WIFI_CMD_SET_AUTO_RECONNECT,
                         &auto_reconnect, sizeof(auto_reconnect),
                         NULL, 0, NULL);
      if (ret < 0)
        {
          goto connect_failed;
        }

      memset(payload, 0, sizeof(payload));
      memcpy(payload, config.ssid, ssid_length);
      memcpy(payload + 33, config.password, password_length);
      ret = wifi_command(BK7258_WIFI_CMD_CONNECT, payload, sizeof(payload),
                         NULL, 0, NULL);
    }
  else
    {
      memset(&request, 0, sizeof(request));
      request.version = BK7258_WIFI_AP_ABI_VERSION;
      request.channel = config.channel;
      request.security = config.wpa_version ==
                         IW_AUTH_WPA_VERSION_DISABLED ?
                         BK7258_WIFI_AP_SECURITY_OPEN :
                         BK7258_WIFI_AP_SECURITY_WPA2;
      request.max_clients = BK7258_WIFI_AP_MAX_CLIENTS;
      request.ssid_length = ssid_length;
      request.password_length = password_length;
      memcpy(request.ssid, config.ssid, ssid_length);
      memcpy(request.password, config.password, password_length);
      ret = wifi_command(BK7258_WIFI_CMD_OPENVELA_AP_START, &request,
                         sizeof(request), &status, sizeof(status),
                         &result_length);
      if (ret >= 0 && result_length != sizeof(status))
        {
          ret = -EPROTO;
        }
      else if (ret >= 0 && status != 0)
        {
          ret = status;
        }

      if (ret >= 0)
        {
          ret = wifi_ap_status_query(&ap_status);
          if (ret >= 0 && !ap_status.started)
            {
              ret = -EIO;
            }
          else if (ret >= 0)
            {
              memcpy(g_wifi.ap_mac, ap_status.mac, sizeof(g_wifi.ap_mac));
              memcpy(g_wifi.lower.netdev.d_mac.ether.ether_addr_octet,
                     ap_status.mac, sizeof(ap_status.mac));
              wifi_ap_start_event(true);
            }
        }
    }

connect_failed:
  if (ret < 0)
    {
      wifi_role_deactivate(role);
    }

  return ret;

connect_unlock:
  rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
  nxmutex_unlock(&g_wifi.packet_lock);
  return ret;
}

static int wifi_disconnect(struct netdev_lowerhalf_s *lower)
{
  (void)lower;
  return wifi_stop_active_role();
}

static int wifi_essid(struct netdev_lowerhalf_s *lower,
                       struct iwreq *request, bool set)
{
  struct wifi_role_config *config;
  size_t length;
  int ret = OK;

  (void)lower;
  if (request->u.essid.pointer == NULL)
    {
      return -EINVAL;
    }

  nxmutex_lock(&g_wifi.packet_lock);
  config = g_wifi.configured_role == WIFI_ROLE_SOFTAP ?
           &g_wifi.ap_config : &g_wifi.sta_config;
  if (set)
    {
      length = request->u.essid.length;
      if (length >= sizeof(config->ssid))
        {
          ret = -E2BIG;
          goto essid_unlock;
        }

      memcpy(config->ssid, request->u.essid.pointer, length);
      config->ssid[length] = '\0';
    }
  else
    {
      length = strlen(config->ssid) + 1;
      if (request->u.essid.length < length)
        {
          request->u.essid.length = length;
          ret = -E2BIG;
          goto essid_unlock;
        }

      memcpy(request->u.essid.pointer, config->ssid, length);
      request->u.essid.length = length;
      request->u.essid.flags = IW_ESSID_ON;
    }

essid_unlock:
  nxmutex_unlock(&g_wifi.packet_lock);
  return ret;
}

static int wifi_passwd(struct netdev_lowerhalf_s *lower,
                       struct iwreq *request, bool set)
{
  struct iw_encode_ext *ext;
  struct wifi_role_config *config;
  int ret = OK;

  (void)lower;
  nxmutex_lock(&g_wifi.packet_lock);
  config = g_wifi.configured_role == WIFI_ROLE_SOFTAP ?
           &g_wifi.ap_config : &g_wifi.sta_config;
  if (!set)
    {
      request->u.encoding.length = 0;
      goto passwd_unlock;
    }

  if ((request->u.encoding.flags & IW_ENCODE_DISABLED) != 0)
    {
      config->password[0] = '\0';
      config->cipher = IW_AUTH_CIPHER_NONE;
      config->wpa_version = IW_AUTH_WPA_VERSION_DISABLED;
      goto passwd_unlock;
    }

  ext = request->u.encoding.pointer;
  if (ext == NULL || ext->key_len >= sizeof(config->password) ||
      (ext->alg != IW_ENCODE_ALG_NONE && ext->alg != IW_ENCODE_ALG_CCMP) ||
      (ext->alg == IW_ENCODE_ALG_NONE && ext->key_len != 0))
    {
      ret = -EINVAL;
      goto passwd_unlock;
    }

