open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
  memcpy(config->password, ext->key, ext->key_len);
  config->password[ext->key_len] = '\0';
  config->cipher = ext->alg == IW_ENCODE_ALG_NONE ?
                   IW_AUTH_CIPHER_NONE : IW_AUTH_CIPHER_CCMP;
  if (ext->alg == IW_ENCODE_ALG_CCMP)
    {
      config->wpa_version = IW_AUTH_WPA_VERSION_WPA2;
    }

passwd_unlock:
  nxmutex_unlock(&g_wifi.packet_lock);
  return ret;
}

static int wifi_country(struct netdev_lowerhalf_s *lower,
                        struct iwreq *request, bool set)
{
  struct bk7258_wifi_country country;
  struct bk7258_wifi_country_response response;
  uint16_t result_length = 0;
  int ret;

#ifndef CONFIG_BK7258_WIFI_CP_EXTENSIONS
  return -ENOTSUP;
#endif

  (void)lower;
  if (request == NULL || request->u.data.pointer == NULL)
    {
      return -EINVAL;
    }

  if (set)
    {
      if (request->u.data.length != 2)
        {
          return -EINVAL;
        }

      memset(&country, 0, sizeof(country));
      memcpy(country.cc, request->u.data.pointer, 2);
      country.cc[2] = '\0';
      country.start_channel = 1;
      country.channel_count = country.cc[0] == 'J' && country.cc[1] == 'P' ?
                              14 : 13;
      country.policy = 1;
      ret = wifi_command(BK7258_WIFI_CMD_OPENVELA_COUNTRY_SET, &country,
                         sizeof(country), &response.status,
                         sizeof(response.status), &result_length);
      if (ret < 0)
        {
          return ret;
        }

      if (result_length != sizeof(response.status))
        {
          return -EPROTO;
        }

      return response.status;
    }

  if (request->u.data.length < 2)
    {
      request->u.data.length = 2;
      return -E2BIG;
    }

  memset(&response, 0, sizeof(response));
  ret = wifi_command(BK7258_WIFI_CMD_OPENVELA_COUNTRY_GET, NULL, 0,
                     &response, sizeof(response), &result_length);
  if (ret < 0)
    {
      return ret;
    }

  if (result_length != sizeof(response))
    {
      return -EPROTO;
    }

  if (response.status != 0)
    {
      return response.status;
    }

  memcpy(request->u.data.pointer, response.country.cc, 2);
  request->u.data.length = 2;
  return OK;
}

static int wifi_mode(struct netdev_lowerhalf_s *lower,
                     struct iwreq *request, bool set)
{
  enum wifi_role role;
  irqstate_t flags;

  (void)lower;
  if (set)
    {
      if (request->u.mode != IW_MODE_INFRA &&
          request->u.mode != IW_MODE_MASTER)
        {
          return -EINVAL;
        }
#ifndef CONFIG_BK7258_WIFI_CP_EXTENSIONS

      if (request->u.mode == IW_MODE_MASTER)
        {
          return -ENOTSUP;
        }
#endif

      role = request->u.mode == IW_MODE_MASTER ? WIFI_ROLE_SOFTAP :
                                                WIFI_ROLE_STA;
      nxmutex_lock(&g_wifi.packet_lock);
      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
      if (g_wifi.active_role != WIFI_ROLE_NONE)
        {
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          nxmutex_unlock(&g_wifi.packet_lock);
          return -EBUSY;
        }

      g_wifi.configured_role = role;
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      nxmutex_unlock(&g_wifi.packet_lock);
    }
  else
    {
      nxmutex_lock(&g_wifi.packet_lock);
      request->u.mode = g_wifi.configured_role == WIFI_ROLE_SOFTAP ?
                        IW_MODE_MASTER : IW_MODE_INFRA;
      nxmutex_unlock(&g_wifi.packet_lock);
    }

  return OK;
}

static int wifi_auth(struct netdev_lowerhalf_s *lower,
                     struct iwreq *request, bool set)
{
  struct wifi_role_config *config;
  int32_t value;
  int ret = OK;

  (void)lower;
  nxmutex_lock(&g_wifi.packet_lock);
  config = g_wifi.configured_role == WIFI_ROLE_SOFTAP ?
           &g_wifi.ap_config : &g_wifi.sta_config;
  if (set)
    {
      value = request->u.param.value;
      switch (request->u.param.flags & IW_AUTH_INDEX)
        {
          case IW_AUTH_WPA_VERSION:
            if (value != IW_AUTH_WPA_VERSION_DISABLED &&
                value != IW_AUTH_WPA_VERSION_WPA2)
              {
                ret = -EOPNOTSUPP;
                goto auth_unlock;
              }

            config->wpa_version = value;
            if (value == IW_AUTH_WPA_VERSION_DISABLED)
              {
                config->cipher = IW_AUTH_CIPHER_NONE;
                config->password[0] = '\0';
              }
            break;

          case IW_AUTH_CIPHER_PAIRWISE:
          case IW_AUTH_CIPHER_GROUP:
            if (value != IW_AUTH_CIPHER_NONE &&
                value != IW_AUTH_CIPHER_CCMP)
              {
                ret = -EOPNOTSUPP;
                goto auth_unlock;
              }

            config->cipher = value;
            break;

          default:
            ret = -EOPNOTSUPP;
            goto auth_unlock;
        }
    }
  else
    {
      switch (request->u.param.flags & IW_AUTH_INDEX)
        {
          case IW_AUTH_WPA_VERSION:
            request->u.param.value = config->wpa_version;
            break;

          case IW_AUTH_CIPHER_PAIRWISE:
          case IW_AUTH_CIPHER_GROUP:
            request->u.param.value = config->cipher;
            break;

          default:
            ret = -EOPNOTSUPP;
            goto auth_unlock;
        }
    }

auth_unlock:
  nxmutex_unlock(&g_wifi.packet_lock);
  return ret;
}

static int wifi_freq(struct netdev_lowerhalf_s *lower,
                     struct iwreq *request, bool set)
{
  struct wifi_role_config *config;
  uint8_t channel;
  irqstate_t flags;

  (void)lower;
  if (set)
    {
      if (request->u.freq.e != 0 || request->u.freq.m < 1 ||
          request->u.freq.m > 14)
        {
          return -EINVAL;
        }

      channel = request->u.freq.m;
      nxmutex_lock(&g_wifi.packet_lock);
      config = g_wifi.configured_role == WIFI_ROLE_SOFTAP ?
               &g_wifi.ap_config : &g_wifi.sta_config;
      flags = rspin_lock_irqsave(&g_bk7258_driver_lock);
      if (g_wifi.active_role == WIFI_ROLE_SOFTAP &&
          g_wifi.role_state != WIFI_ROLE_IDLE &&
          channel != g_wifi.ap_config.channel)
        {
          rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
          nxmutex_unlock(&g_wifi.packet_lock);
          return -EBUSY;
        }

