open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
      config->channel = channel;
      rspin_unlock_irqrestore(&g_bk7258_driver_lock, flags);
      nxmutex_unlock(&g_wifi.packet_lock);
    }
  else
    {
      nxmutex_lock(&g_wifi.packet_lock);
      config = g_wifi.configured_role == WIFI_ROLE_SOFTAP ?
               &g_wifi.ap_config : &g_wifi.sta_config;
      request->u.freq.m = config->channel;
      request->u.freq.e = 0;
      request->u.freq.i = 0;
      request->u.freq.flags = IW_FREQ_FIXED;
      nxmutex_unlock(&g_wifi.packet_lock);
    }

  return OK;
}

static int wifi_bssid(struct netdev_lowerhalf_s *lower,
                      struct iwreq *request, bool set)
{
  struct bk7258_wifi_ap_status_response response;
  int ret;

  (void)lower;
  if (set)
    {
      return -EOPNOTSUPP;
    }

  ret = wifi_ap_status_query(&response);
  if (ret < 0)
    {
      return ret;
    }

  memset(&request->u.ap_addr, 0, sizeof(request->u.ap_addr));
  request->u.ap_addr.sa_family = ARPHRD_ETHER;
  memcpy(request->u.ap_addr.sa_data, response.mac, sizeof(response.mac));
  return OK;
}

static int wifi_scan(struct netdev_lowerhalf_s *lower,
                      struct iwreq *request, bool set)
{
  uint8_t ssid[33];
  int32_t status;
  uint16_t result_length;
  int ret;

#ifndef CONFIG_BK7258_WIFI_CP_EXTENSIONS
  return -ENOTSUP;
#endif

  (void)lower;
  if (request == NULL)
    {
      return -EINVAL;
    }

  nxmutex_lock(&g_wifi.packet_lock);
  if (g_wifi.active_role == WIFI_ROLE_SOFTAP)
    {
      nxmutex_unlock(&g_wifi.packet_lock);
      return -EBUSY;
    }

  nxmutex_unlock(&g_wifi.packet_lock);
  if (!set)
    {
      nxmutex_lock(&g_wifi.scan_lock);
      if (g_wifi.scan_running)
        {
          nxmutex_unlock(&g_wifi.scan_lock);
          return -EAGAIN;
        }

      if (!g_wifi.scan_cached)
        {
          ret = wifi_scan_cache_fetch();
          if (ret < 0)
            {
              nxmutex_unlock(&g_wifi.scan_lock);
              return ret;
            }
        }

      if (request->u.data.pointer == NULL ||
          request->u.data.length < g_wifi.scan_cache_length)
        {
          request->u.data.length = g_wifi.scan_cache_length;
          nxmutex_unlock(&g_wifi.scan_lock);
          return -E2BIG;
        }

      memcpy(request->u.data.pointer, g_wifi.scan_cache,
             g_wifi.scan_cache_length);
      request->u.data.length = g_wifi.scan_cache_length;
      nxmutex_unlock(&g_wifi.scan_lock);
      return OK;
    }

  nxmutex_lock(&g_wifi.scan_lock);
  wifi_scan_cache_clear();
  memset(ssid, 0, sizeof(ssid));
  if ((request->u.data.flags & IW_SCAN_THIS_ESSID) != 0 &&
      request->u.data.pointer != NULL &&
      request->u.data.length >= sizeof(struct iw_scan_req))
    {
      const struct iw_scan_req *scan = request->u.data.pointer;
      size_t length = scan->essid_len;

      if (length > sizeof(ssid) - 1)
        {
          length = sizeof(ssid) - 1;
        }

      memcpy(ssid, scan->essid, length);
    }

  result_length = 0;
  status = 0;
  ret = wifi_command(BK7258_WIFI_CMD_SCAN_WIFI, ssid, sizeof(ssid),
                     &status, sizeof(status), &result_length);
  if (ret >= 0 && result_length != sizeof(status))
    {
      printf("wifi scan start invalid response length: %u\n", result_length);
      ret = -EPROTO;
    }
  else if (ret >= 0 && status != 0)
    {
      printf("wifi scan start rejected: %ld\n", (long)status);
      ret = status;
    }
  else if (ret < 0)
    {
      printf("wifi scan start transport failed: %d\n", ret);
    }

  if (ret == OK)
    {
      g_wifi.scan_running = true;
    }

  nxmutex_unlock(&g_wifi.scan_lock);
  return ret;
}

static int wifi_range(struct netdev_lowerhalf_s *lower,
                      struct iwreq *request)
{
  struct iw_range *range = request->u.data.pointer;
  uint8_t i;

  (void)lower;
  if (range == NULL || request->u.data.length < sizeof(*range))
    {
      return -EINVAL;
    }

  memset(range, 0, sizeof(*range));
  range->num_frequency = 14;
  for (i = 0; i < range->num_frequency; i++)
    {
      range->freq[i].m = i + 1;
    }

  request->u.data.length = sizeof(*range);
  return OK;
}

static const struct wireless_ops_s g_wifi_ops =
{
  .connect = wifi_connect,
  .disconnect = wifi_disconnect,
  .essid = wifi_essid,
  .bssid = wifi_bssid,
  .passwd = wifi_passwd,
  .mode = wifi_mode,
  .auth = wifi_auth,
  .freq = wifi_freq,
  .bitrate = NULL,
  .txpower = NULL,
  .country = wifi_country,
  .sensitivity = NULL,
  .scan = wifi_scan,
  .range = wifi_range
};
#endif

static const struct netdev_ops_s g_netdev_ops =
{
  .ifup = wifi_ifup,
  .ifdown = wifi_ifdown,
  .transmit = wifi_transmit,
  .receive = wifi_receive,
#ifdef CONFIG_NETDEV_IOCTL
  .ioctl = wifi_ioctl,
#endif
};

int bk7258_wifi_initialize(void)
{
  uint8_t mac[6];
  struct wifi_probe_status_s status;
#ifdef CONFIG_BK7258_WIFI_CP_EXTENSIONS
  struct bk7258_wifi_ap_status_response ap_status;
#endif
  uint16_t length = 0;
  unsigned int i;
  int ret;

  static_assert(sizeof(CONFIG_BK7258_WIFI_IFNAME) > 3 &&
                 sizeof(CONFIG_BK7258_WIFI_IFNAME) <= IFNAMSIZ,
                 "Wi-Fi interface name must fit IFNAMSIZ");
  if (strpbrk(CONFIG_BK7258_WIFI_IFNAME, "%/ :\t\r\n") != NULL)
    {
      return -EINVAL;
    }

  if (g_wifi.initialized)
    {
      return OK;
    }

  memset(&g_wifi, 0, sizeof(g_wifi));
  nxmutex_init(&g_wifi.command_lock);
  nxmutex_init(&g_wifi.event_lock);
  nxmutex_init(&g_wifi.packet_lock);
  nxmutex_init(&g_wifi.scan_lock);
  nxsem_init(&g_wifi.command_sem, 0, 0);
  nxsem_init(&g_wifi.role_sem, 0, 0);
  nxsem_init(&g_wifi.work_sem, 0, 0);
  nxsem_init(&g_wifi.ready_sem, 0, 0);
  g_worker_result = -EINPROGRESS;
  g_wifi.reset_generation = bk7258_mailbox_peer_reset_generation();
  for (i = 0; i < BK7258_WIFI_CMD_SLOTS; i++)
    {
      *(uint32_t *)g_wifi.command[i].bytes =
        BK7258_WIFI_CMD_PATTERN_FREE;
    }

  /* Explicitly, and before the worker below starts touching the chains: the
   * memset above leaves these zero, and zero is slot 0 rather than "no
   * slot".
   */

  g_wifi.tx_pend_head = WIFI_TX_CHAIN_END;
  g_wifi.tx_pend_tail = WIFI_TX_CHAIN_END;
  g_wifi.tx_sent_head = WIFI_TX_CHAIN_END;
  for (i = 0; i < CONFIG_BK7258_WIFI_TX_SLOTS; i++)
    {
      g_wifi.tx[i].chain_next = WIFI_TX_CHAIN_END;
    }

  ret = bk7258_mailbox_register_rx(BK7258_WIFI_CMD_RX_CHANNEL,
                                   wifi_mailbox_rx, NULL);
  if (ret < 0)
    {
      return ret;
    }

