open-vela/nuttx/arch/arm/src/bk7258/bk7258_wifi.c
  ret = bk7258_mailbox_register_rx(BK7258_WIFI_DATA_RX_CHANNEL,
                                   wifi_mailbox_rx, NULL);
  if (ret < 0)
    {
      return ret;
    }

  bk7258_mailbox_set_link_callback(wifi_link_changed, NULL);
  ret = kthread_create("bk-wifi", 110, 3072, wifi_worker, NULL);
  if (ret < 0)
    {
      return ret;
    }

  if (nxsem_tickwait_uninterruptible(&g_wifi.ready_sem,
                                     MSEC2TICK(200)) < 0)
    {
      return -ETIMEDOUT;
    }

  if (g_worker_result < 0)
    {
      return g_worker_result;
    }

  g_wifi.lower.ops = &g_netdev_ops;
#ifdef CONFIG_NETDEV_WIRELESS_HANDLER
  g_wifi.lower.iw_ops = &g_wifi_ops;
#endif
  g_wifi.lower.quota[NETPKT_TX] = CONFIG_BK7258_WIFI_TX_SLOTS;
  g_wifi.lower.quota[NETPKT_RX] = WIFI_RX_QUOTA;
  g_wifi.lower.rxtype = NETDEV_RX_WORK;
  g_wifi.lower.netdev.d_pktsize = BK7258_WIFI_MAX_FRAME;
  g_wifi.configured_role = WIFI_ROLE_STA;
  g_wifi.active_role = WIFI_ROLE_NONE;
  g_wifi.role_state = WIFI_ROLE_IDLE;
  g_wifi.role_epoch = 1;
  g_wifi.sta_config.wpa_version = IW_AUTH_WPA_VERSION_DISABLED;
  g_wifi.sta_config.cipher = IW_AUTH_CIPHER_NONE;
  g_wifi.ap_config.wpa_version = IW_AUTH_WPA_VERSION_DISABLED;
  g_wifi.ap_config.cipher = IW_AUTH_CIPHER_NONE;
  g_wifi.ap_config.channel = 1;

  memset(mac, 0, sizeof(mac));
  ret = wifi_command(BK7258_WIFI_CMD_GET_MAC_ADDR, NULL, 0,
                     mac, sizeof(mac), &length);
  if (ret < 0 || length != sizeof(mac))
    {
      return ret < 0 ? ret : -EPROTO;
    }

  if ((mac[0] & 1) != 0 ||
      (mac[0] | mac[1] | mac[2] | mac[3] | mac[4] | mac[5]) == 0)
    {
      return -EPROTO;
    }

  memcpy(g_wifi.lower.netdev.d_mac.ether.ether_addr_octet, mac, sizeof(mac));
  memcpy(g_wifi.sta_mac, mac, sizeof(mac));
#ifdef CONFIG_BK7258_WIFI_CP_EXTENSIONS
  ret = wifi_ap_status_query(&ap_status);
  if (ret < 0)
    {
      return ret;
    }

  memcpy(g_wifi.ap_mac, ap_status.mac, sizeof(g_wifi.ap_mac));
#endif

  memset(&status, 0, sizeof(status));
  ret = wifi_command(BK7258_WIFI_CMD_GET_WLAN_STATUS, NULL, 0,
                     &status, sizeof(status), &length);
  if (ret < 0 || length != sizeof(status))
    {
      return ret < 0 ? ret : -EPROTO;
    }

  memcpy(g_wifi.lower.netdev.d_ifname, CONFIG_BK7258_WIFI_IFNAME,
         sizeof(CONFIG_BK7258_WIFI_IFNAME));
  ret = netdev_lower_register(&g_wifi.lower, NET_LL_IEEE80211);
  if (ret < 0)
    {
      return ret;
    }

  g_wifi.initialized = true;
  g_wifi.carrier_notified = !g_wifi.carrier;
  wifi_notify_carrier();
  return OK;
}

#ifdef CONFIG_BK7258_CP_TRNG
int bk7258_wifi_profile_command(unsigned int operation,
                               struct bk7258_wifi_profile *profile)
{
  struct bk7258_wifi_profile_request request =
    {
      0
    };

  struct bk7258_wifi_profile_response response =
    {
      0
    };

  uint16_t received = 0;
  int ret;

  if (operation > BK7258_WIFI_PROFILE_CLEAR ||
      (operation != BK7258_WIFI_PROFILE_CLEAR && profile == NULL))
    {
      return -EINVAL;
    }

  if (operation == BK7258_WIFI_PROFILE_SET)
    {
      if (!bk7258_wifi_profile_valid(profile))
        {
          return -EINVAL;
        }

      request.profile = *profile;
    }
  else if (profile != NULL)
    {
      explicit_bzero(profile, sizeof(*profile));
    }

  request.operation = operation;
  ret = wifi_command(BK7258_WIFI_PROFILE_CMD, &request, sizeof(request),
                     &response, sizeof(response), &received);
  if (ret >= 0)
    {
      if (received != sizeof(response)) ret = -EPROTO;
      else if (response.status == BK7258_WIFI_PROFILE_MISSING) ret = -ENOENT;
      else if (response.status == BK7258_WIFI_PROFILE_INVALID) ret = -EINVAL;
      else if (response.status != BK7258_WIFI_PROFILE_OK) ret = -EIO;
      else if (operation == BK7258_WIFI_PROFILE_GET)
        {
          if (!bk7258_wifi_profile_valid(&response.profile)) ret = -EPROTO;
          else *profile = response.profile;
        }
    }

  explicit_bzero(&request, sizeof(request));
  explicit_bzero(&response, sizeof(response));
  return ret;
}

int bk7258_wifi_random_block(void *buffer, size_t length)
{
  struct
  {
    int32_t status;
    uint32_t version;
    uint8_t bytes[32];
  } response =
    {
      0
    };

  uint16_t received = 0;
  int ret;

  static_assert(sizeof(response) == 40, "CP TRNG ABI size");
  if (buffer == NULL || length != sizeof(response.bytes))
    {
      return -EINVAL;
    }

  if (!g_wifi.initialized)
    {
      return -ENODEV;
    }

  ret = wifi_command(0x213u, NULL, 0, &response, sizeof(response),
                     &received);
  if (ret == OK && (received != sizeof(response) || response.version != 1))
    {
      ret = -EPROTO;
    }

  if (ret == OK && response.status != 0)
    {
      ret = -EIO;
    }

  if (ret == OK)
    {
      memcpy(buffer, response.bytes, length);
    }

  explicit_bzero(&response, sizeof(response));
  return ret;
}
#endif

int bk7258_wifi_probe(void)
{
  struct wifi_probe_status_s status;
  uint16_t length = 0;
  uint8_t mac[6];
  int ret;

  if (!g_wifi.initialized)
    {
      printf("Wi-Fi netdev is not initialized\n");
      return -ENODEV;
    }

  ret = wifi_command(BK7258_WIFI_CMD_GET_MAC_ADDR, NULL, 0,
                     mac, sizeof(mac), &length);
  if (ret < 0 || length != sizeof(mac))
    {
      return ret < 0 ? ret : -EPROTO;
    }

  ret = wifi_command(BK7258_WIFI_CMD_GET_WLAN_STATUS, NULL, 0,
                     &status, sizeof(status), &length);
  if (ret < 0 || length != sizeof(status))
    {
      return ret < 0 ? ret : -EPROTO;
    }

  printf("Wi-Fi probe: v15 shared netdev command channel\n");
  printf("CP MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
         mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  printf("CP state=%u RSSI=%d SSID=%.33s\n",
         status.state, status.rssi, status.ssid);
  printf("AP netdev: %s; use ifconfig for AP IPv4/DHCP status\n",
         g_wifi.lower.netdev.d_ifname);
  return OK;
}

int bk7258_wifi_register_event_callback(bk7258_wifi_event_cb_t callback,
                                        void *arg)
{
  if (callback == NULL)
    {
      return -EINVAL;
    }

  if (!g_wifi.initialized)
    {
      return -ENODEV;
    }

  nxmutex_lock(&g_wifi.event_lock);
  if (g_wifi_event_callback != NULL &&
      (g_wifi_event_callback != callback || g_wifi_event_arg != arg))
    {
      nxmutex_unlock(&g_wifi.event_lock);
      return -EBUSY;
    }

  g_wifi_event_arg = arg;
  g_wifi_event_callback = callback;
  nxmutex_unlock(&g_wifi.event_lock);
  return OK;
}

void bk7258_wifi_unregister_event_callback(bk7258_wifi_event_cb_t callback,
                                           void *arg)
{
  nxmutex_lock(&g_wifi.event_lock);
  if (g_wifi_event_callback == callback && g_wifi_event_arg == arg)
    {
      g_wifi_event_callback = NULL;
      g_wifi_event_arg = NULL;
    }

  nxmutex_unlock(&g_wifi.event_lock);
}

/****************************************************************************
 * Name: bk7258_net_get_counters
 *
 * Description:
 *   Snapshot of the whole path between a socket and the antenna: this
 *   driver's own frame accounting plus the mailbox layers underneath it.
 *
 *   No lock is taken.  Every field is a word-sized counter that only ever
 *   increases, and the callers of this measure rates over seconds, so the
 *   worst a concurrent update can do is attribute one event to the
 *   neighbouring interval.  Taking packet_lock here would instead stall the
 *   transmit path at the moment the measurement is trying hardest not to
 *   disturb it.
 *
 ****************************************************************************/

void bk7258_net_get_counters(struct bk7258_net_counters *counters)
{
  if (counters == NULL)
    {
      return;
    }

  memset(counters, 0, sizeof(*counters));

  bk7258_mailbox_fill_counters(counters);

  counters->wifi_tx_batches      = g_wifi.tx_batches;
  counters->wifi_tx_frames       = g_wifi.tx_batched_frames;
  counters->wifi_tx_batch_max    = g_wifi.tx_batch_max;
  counters->wifi_tx_enetdown     = g_wifi.tx_enetdown;
  counters->wifi_tx_slots_full   = g_wifi.tx_slots_full;
  counters->wifi_tx_rejected     = g_wifi.tx_rejected;

  counters->wifi_rx_lists        = g_wifi.rx_lists;
  counters->wifi_rx_frames       = g_wifi.rx_listed_frames;
  counters->wifi_tx_completions  = g_wifi.tx_completions;
  counters->wifi_rx_queue_full   = g_wifi.rx_queue_full;
  counters->wifi_rx_alloc_fail   = g_wifi.rx_alloc_fail;
  counters->wifi_rx_list_max     = g_wifi.rx_list_max;
  counters->wifi_rx_list_ceiling = BK7258_WIFI_MAX_LIST;
}

#endif /* CONFIG_BK7258_WIFI */
